{"date": "2015-12-22", "text": "Trump Campaign Enlists Support in Over 200 Communities(New York, NY) December 22nd, 2015 - Today Donald J. Trump announced Town Chairs in over 200 communities in New Hampshire. Mr. Trump remains the national front-runner for the Republican nomination for President of the United States and maintains a wide, double digit lead in all recent New Hampshire polls.Mr. Trump stated, \"It is a great honor to have such incredible grassroots support across the state of New Hampshire. We have tremendous poll results and crowds and I look forward to visiting many times over the next several weeks. With the support of each Town Chair and so many others, we will Make America Great Again!\"This is yet another example of Mr. Trump's extensive support in the first in the nation primary state. The Trump Campaign has offices in Manchester, Keene, Newmarket and Colebrook, over a dozen paid staffers and thousands of volunteers helping to share Mr. Trump's vision to make the country better than ever before.Mr. Trump will return to New Hampshire on Monday, December 28th to host a rally in Nashua. Most recently, Mr. Trump visited Portsmouth to receive the coveted endorsement of the New England Police Benevolent Association, where he was joined by hundreds of officers supporting his campaign for President.New Hampshire Town Chairs:Adelina Winfield of Hennikerin in Merrimack CountyAl Constant of Gilmanton IW in Belknap CountyAl Letizio Jr. of Rockingham County in Windham, NH Alan Balog of Starkin Coos CountyAlex Scott of Canterbury in Merrimack CountyAlexis Chechowitz of Hampton Beach in Rockingham CountyAllie McIntosh of Chichester in Merrimack CountyAmy Brooks of Stewartstown in Coos CountyAndrew Disbrow of Grafton in Grafton CountyAndrew Horvit of Londonderry in Rockingham CountyAndrew Scolaro of Center Barnstead in Belknap CountyAngelina Falcon of Bristol in Grafton CountyAnne Miller of New Castle in Rockingham CountyAnthony Campello of East Kingston in Rockingham CountyAshley Custance of Campton in Grafton CountyBarbara Ferdinando of Manchester in Hillsborough CountyBarbara Kresse of Croydon in Sullivan CountyBarbara Maloney of Stratham in Rockingham CountyBen Soussan of Hampton in Rockingham CountyBill Schroeter of Unity in Sullivan CountyBob Heghmann of Wolfeboro in Carroll CountyBrandon Fields of Lancaster in Coos CountyBrenda Beauregard of Center Ossipee in Carroll CountyBrenda Case of Alexandria in Grafton CountyBrenna Cavanaughof Portsmouth in Rockingham CountyBrian Fulwood of Gilsum in Cheshire CountyBrian Mitchell of Rye Beach in Rockingham CountyBruce Breton of Rockingham County in Windham, NH Bruce Kozikowski of South Sutton in Merrimack CountyCarol Ann Mcfarland of Chester in Rockingham CountyCarol Vincelette of Benton in Grafton CountyCatherine Hall of Deerfield in Rockingham CountyCharles Colbert of Brookline in Hillsborough CountyCheryl Jones of Claremont in Sullivan CountyChip Kelley of Rye in Rockingham CountyChris Dawe of Hampton Falls in Rockingham CountyChris Fela of Barrington in Strafford CountyChris Gilman of Gorham in Coos CountyChris Kachanian of Atkinson in Rockingham CountyChris Linker of Madbury in Strafford CountyChristopher Carter of Deering in Hillsborough CountyChristopher Mazerall of Jaffrey in Cheshire CountyChuck Beauregard of Troy in Cheshire CountyCindy Fitzgerald of Bethlehem in Grafton CountyColin Cambo of Rollinsford in Strafford CountyCorey Garabedian of Salem in Rockingham CountyCrae Hoffmaster of Kensington in Rockingham CountyCraig Gidley of Hillsborough in Hillsborough CountyDan Stolworthy of South Hampton in Rockingham CountyDana Cullen of Ossipee in Carroll CountyDavid Brock of Pinardville in Hillsborough CountyDavid Brown of Fremont in Rockingham CountyDavid Gattuso of Deerfield in Rockingham CountyDavid Prescott of Ossipee in Carroll CountyDeb Ackerman of Berlin in Coos CountyDebbie Balog of Jefferson in Coos CountyDebbie Demarais of Hudson in Hillsborough CountyDebra Reilly of Alstead in Cheshire CountyDeena Forcier of Sullivan in Cheshire CountyDennis Romeo of Hooksett in Merrimack CountyDerek Paul of Swanzey in Cheshire CountyDiane Abdy of Bristol in Grafton CountyDick Wentzel of Newport in Sullivan CountyDon Bacon of Newfields in Rockingham CountyDon Medbury of Dover in StraffordCountyDonald Dotsie of Stratford in Coos CountyDonald Murphy of Mont Vernon in Hillsborough CountyDonna Horvit of Londonderryin Rockingham CountyDorothy Habben of Hopkinton in Merrimack CountyDoug Lambert of Gilford in Belknap CountyDrew Carter of Sutton in Merrimack CountyDuncan Britton of Auburn in Rockingham CountyEd Bissonof Andover in Merrimack CountyEddie Gargiulo of Newmarket in Rockingham CountyElisabeth Malboeuf of Mason in Hillsborough CountyElizabeth Varney of Alton in Belknap CountyEllen Cuccio of Conway in Carroll CountyEllen Williams of Newbury in Merrimack CountyEric Corum of Gilmanton in Belknap CountyEric Kelso of Canterbury in Merrimack CountyEric Miller of New Castle in Rockingham CountyErik Wallof Peterborough in Hillsborough CountyEvan Nelson of Littleton in Grafton CountyFrancine Monica of Wentworth in Grafton CountyFred Gilman of Gorham in Coos CountyGary Brown of Raymond in Rockingham CountyGary Fouts of Danbury in Merrimack CountyGeorge Carmichael of Rindge in Cheshire CountyGeorgia Palmieri of Keene in Cheshire CountyGerard Deshaies of Portsmouth in Rockingham CountyGil Towne of Derry in Rockingham CountyGlen Hyslop of Milton in Strafford CountyGordon Gowen of Acworth in Sullivan CountyGriffin Gamache of Durham in Strafford CountyHarold Moller of Sunapee in Sullivan CountyHeidi Buxton of Pittsfield in Merrimack CountyHelen Molloy of Lincoln in Grafton CountyHolly Young of Plymouth in Grafton CountyHon. Al Baldassaro of Londonderry in Rockingham CountyHon. Dan Itse of Fremont in RockinghamCountyHon. Dan Tamburello of Londonderry in Rockingham CountyHon. George Lambert of Litchfield in Hillsborough CountyHon. Joe Pitre of Farmington in Strafford CountyHon. John Hikel of Goffstown in Hillsborough CountyHon. Laurie Pettengill of Bartlett in Carroll CountyHon. Peter Varney of Alton in Belknap CountyHon. Steven J Woitkun of Danville in Rockingham CountyHon. Tom Boriso of Meredith in Belknap CountyHon. Werner Horn of Franklin in Merrimack CountyJames King of New Ipswich in Hillsborough CountyJames Yamartino of Bartlett in Carroll CountyJane Quale of Hanover in Grafton CountyJanet Bunnell of Kensington in Rockingham CountyJason Rella of Colebrook in Coos CountyJason Udeen of Surry in Cheshire CountyJay C Davey of Plaistow in Rockingham CountyJayne Fiore of Epping in Rockingham CountyJeannie Hines of Rumney in Grafton CountyJeff Hiattof Newington in Rockingham CountyJeff Odhner of Amherst in Hillsborough CountyJene Liepold of Grantham in Sullivan CountyJennifer Warren of Allenstown in Merrimack CountyJill Stocking of Washington in Sullivan CountyJim Cropsey of Tilton in Belknap CountyJoe Capuzzo of Thornton in Grafton CountyJoe Montanaro of Windham in Rockingham CountyJoe Silveira of Candia in Rockingham CountyJoe St. Jean of Kingston in Rockingham CountyJohn Washburn of Merrimack in Hillsborough CountyJohn Woods of Amherst in Hillsborough CountyJolene Levesque of Northwood in Rockingham CountyJolene Vogelien of Orford in Grafton CountyJoseph Castagnaro of Gilford in Belknap CountyJoseph Gasparik of Enfield in Grafton CountyJoseph Wysocki of Henniker in Merrimack CountyJulianne Griffin of Laconia in Belknap CountyJulianne Pagliaruloof Belmont in Belknap CountyJulie Newcombe of Bennington in Hillsborough CountyKaren Goerndt of Brentwood in Rockingham CountyKaren Lewandoski of Tilton in Belknap CountyKarl Zahn of Milford in Hillsborough CountyKathy Corso of Center Harbor in Belknap CountyKathy Duane of Hale's Location in Carroll CountyKatie Haughton of Nottingham in Rockingham CountyKatrina Kekalo of Lebanon in Grafton CountyKelly Frenette of Seabrook in Rockingham CountyKen Martell of Groton in Grafton CountyKen Patey of Hampstead in Rockingham CountyKen Strong of Northumberland in Coos CountyKenneth Finn of Greenfield in Hillsborough CountyKevin Bazan of Winchester in Cheshire CountyKevin Genest of Barnstead in Belknap CountyKevin Roy of Barrington in Strafford CountyLana Miller of Plaistow in Rockingham CountyLaura Soussan of Hampton in Rockingham CountyLaurie Caruso of Greenland in Rockingham CountyLois DeYoung of Brentwood in Rockingham CountyLori Davis of Weare in Hillsborough CountyLorrie Clark of Newton in Rockingham CountyLouise Bacon of Newfields in Rockingham CountyLuke Sacher of Fitzwilliam in Cheshire CountyMadelene Beaulieu of Hollis in Hillsborough CountyMalia Boaz of Westmoreland in Cheshire CountyMarc Normandin of Stoddard in Cheshire CountyMaria Noel of Ashland in Grafton CountyMarilyn Stacy of Tuftonboro in Carroll CountyMarilyn Walsh of Bethlehem in Grafton CountyMark French of Bridgewater in Grafton CountyMark Kilbane of Exeter in Rockingham CountyMark Morrison of Stewartstown in Coos CountyMarlene Smith of Bow in Merrimack CountyMartin Judd of Hill in Merrimack CountyMary Ann Adams of Holderness in Grafton CountyMatt Crow of New Boston in Hillsborough CountyMatt Pitaro of Bedford in Hillsborough CountyMaurice Glaude of Francestown in Hillsborough CountyMelanie Benton of New Hamptonin Belknap CountyMelissa Boccelli of Sandown in Rockingham CountyMichael Bushway of Contoocook in Merrimack CountyMichael Parker of Piermont in Grafton CountyMichael Parrott of Surry in Cheshire CountyMichael Weston of Hinsdale in Cheshire CountyMichele Autenzio of Moultonborough in Carroll CountyMichele Paradiso of Rochester in Strafford CountyMichelle Perron of Hampton in Rockingham CountyMonica Charpentier of Hooksett in Merrimack CountyNancy Weston of Hinsdale in Cheshire CountyNate Lynch of Walpole in Cheshire CountyNeal Burns of New Durhamin Strafford CountyNicholas Mignanelli of Campton in Grafton CountyNorman Brooks of Stewartstown in Coos CountyPatricia Cook of Haverhill in Grafton CountyPatrick Mooney of Wakefield in Carroll CountyPaul Barnet of Sanbornton in Belknap CountyPaul Fisher of New Ipswich in HillsboroughPaul Garabedian of Salem in Rockingham CountyPaul Morrissette of Loudon in Merrimack CountyPaul Nagy of East Andover in Merrimack CountyPaul Rella of Columbia in Coos CountyPaul Smalley of Hebron in Grafton CountyPaul Sodano of Bristol in Grafton CountyPaul Whitney of Harrisville in Cheshire CountyPaula Johnson of Nashua in Hillsborough CountyPaula Malmborg of Penacoook in Merrimack CountyPerry Wagner of Littleton in Grafton CountyPhil Riendeau of Chesterfield in Cheshire CountyPhyllis Buatti of Barnstead in Belknap CountyPriscilla Root of Ashuelot in Cheshire CountyRalph Collins of Milan in Coos CountyRalph DeRosa of Albany in Carroll CountyRay Dewis of Woodstock in Grafton CountyRaymond Heelan of Wilmot in Merrimack CountyRebecca Gifford of Lee in Strafford CountyRex Jenna of Warner in Merrimack CountyRich Autenzio of Moultonborough in Carroll CountyRich Innie of Hooksett in Merrimack CountyRichard Bettcher of North Hampton in Rockingham CountyRichard Cook of Somersworth in Strafford CountyRick Dube of Pittsburg in Coos CountyRick Nadick of Errol in Coos CountyRita Falwell of Hampton Beach in Rockingham CountyRob Peterson of Eaton in Carroll CountyRobert Campbell of Wilton in Hillsborough CountyRobert Loeser Jr. of Salisburyin Merrimack CountyRobert Miller of New Castle in Rockingham CountyRobert Willis of Marlow in Cheshire CountyRonald Tatro of Ashuelot in Cheshire CountyRussell Wyatt of Whitefield in Coos CountySally Bourbeau of Danville in Rockingham CountySandra Laughy of Northfield in Merrimack CountySandy Woodmansee of Epping in Rockingham CountySarah Florio of Freedom in Carroll CountyScott Brown of Webster in Grafton CountyScott Innie of Hooksett in Merrimack CountySen. Dick Ferdinando of Manchester in Hillsborough CountySen. Frank Sapareto of Derry in Rockingham CountyShelly Manougian of Rye in Rockingham CountyShirley Hurd of Derry in Rockingham CountyStephen Keith of Pembroke in Merrimack CountySteve Astrauas of Pelham in Hillsborough CountySteve Digiovanni of Middleton in Strafford CountySteve Walker of Charlestown in Sullivan CountySusan Coulombe of Bristol in Grafton CountySusanne Montanaro of Windham in Rockingham CountyTammy Coutts of Marlborough in Cheshire CountyTammy Sinapius of Effingham in Carroll CountyTara Hooper of Warren in Merrimack CountyTerry Wagner of Littleton in Grafton CountyThomas Kawczynski of Lisbon in Grafton CountyTim Dillon of Concord in Merrimack CountyTodd Smith of Richmond in Cheshire CountyTom Humphrey of Brookline in Hillsborough CountyTommy Sharpe of Clarksville in Coos CountyValerie Rella of Columbia in Coos CountyVicki Wilson of Sandown in Rockingham CountyWarren Hurd of Lempster in Sullivan CountyWayne Fiore of Epping in Rockingham CountyWestley Bailey Jr. of Epsom in Merrimack CountyWilliam Hill of Strafford in Strafford CountyWilliam Maloney of Stratham in Rockingham CountyZac Mercauto of Tamworth in Carroll County", "title": "Press Release - Donald J. Trump Announces New Hampshire Town Chairs"}
