{"date": "2015-12-10", "text": "(New York, NY) December 10, 2015 — Today, Donald J. Trump for President Inc. announced the campaign has officially filed a full slate of state delegates to appear on the ballot in the New Hampshire and Tennessee 2016 Primaries. The Tennessee slate of 82 potential delegates, the most allowed under state law, includes veterans, elected officials and many first time delegates who are drawn to participate in the political process because of Mr. Trump's candidacy and his vision to Make America Great Again.Mr. Trump stated, \"I am so proud with this tremendous showing of support in New Hampshire and Tennessee. We are winning all the polls by huge, double digit margins and have the biggest crowds. With support from each of these incredible delegates and supporters across both states, we will Make America Great Again.\"The list of Trump delegates filed in Tennessee includes:State Senators Mae Beavers and Bill Ketron;Shelby County Commission Chairman, Terry Roland;10 members of the GOP State Executive Committee;Kay White, who served as Rick Santorum's state chair in 2012 when he won Tennessee;Numerous veterans, first time delegates, and former GOP chairs and elected officials.The Trump delegates in Tennessee range in age from 20 years old to 93 year old Beada Corum, who has never registered to vote but did so to be able to vote for Mr. Trump.Trump New Hampshire Delegates Filed:Alfred Baldasaro — 41 Hall Rd, Londonderry, NHJudy Baldasaro — 41 Hall Rd, Londonderry, NHRobert Burns — 1035 South Mammoth Rd, Manchester, NHWillian Cuccio — 186 Randall Farm Rd, North Conway, NHFrederick Doucette — 36 Royal Circle, Salem, NHBarbara Ferdinando — 954 Straw Hill Rd, Manchester, NHRichard Ferdinando — 954 Straw Hill Rd, Manchester, NHLouis Gargiulo —21 Linden Rd, Hampton Falls, NHJarold Gregory Johnson - 329 Sawyers Crossing Rd. Swanzey. NHPaula Johnson — 15 Westborn Drive, Nashua, NHGeorge Lambert — 3 Lydston Lane, Litchfield, NHCorey Lewandowski —21 Emerson Rd. Windham. NHSteven Peterson — 24 Penny Lane. Merrimack, NHStephen Stepanek — I Colonel Wilkins Rd, Amherst. NHEllen Suprunowicz— I Colonel Wilkins Rd, Amherst, NHDaniel Tamburello —3 Royal Lane. Londonderry. NHMichael Teed - 555 Canal St, Apt #910, Manchester, NHElizabeth Varney — 129 Main St, Alton, NHPeter Varney — 129 Main St, Alton. NHJoshua Whitehouse — 45 Foxtrot Drive. Farmington, NH", "title": "Press Release - Donald J. Trump Files Full Slate of Delegates for the New Hampshire and Tennessee Ballots"}
