{"date": "2016-10-18", "text": "Hillary for America Senior National Spokesperson Glen Caplin released the following statement today after Donald Trump's comments saying he, \"Could see myself meeting with Putin and meeting with Russia prior to the start of the administration.\"\"It's unclear why Donald Trump needs to meet with Vladimir Putin onВ November 9thВ since he's already repeating all his talking points, pushing his policy agenda and taking advantage of his espionage operation. Rest assured that as president, Hillary Clinton will stand up to Putin in the face of his unacceptable behavior, not coddle him.\"Hillary for America previously released a new video cataloguing Trump's disturbing connections to Russia and why they are so concerning. Watch itВ here.The campaign also recently released a Medium post on the Russian hack that Donald Trump refuses to admit or condemn laying out an important question that voters deserve to know - \"What did Trump know, and when did he know it?\" Read itВ here.Here are 15 facts you should know about Donald Trump, WikiLeaks and Russia:1) The U.S. intelligence community hasВ concludedВ that top Kremlin officials are behind the hack of the DNC and other Democratic organizations to influence the elections В– and named WikiLeaks as part of their effort. Washington Post:\"Intelligence officials have identified WikiLeaks and other sites as among those receiving or publishing information from Russian intelligence, a claim that Assange has dismissed in the past.2) According to theВ Wall Street Journal,В \"FBI Suspects Russia in Hack of John Podesta Emails\"- top Russian officials meanwhile shifted away from denying a role in separate hacking of the Democratic National Committee.3) Long time Trump campaign associate Roger StoneВ saysВ he is in contact with Julian Assange.В Stone unwittingly admitted the Russians are the source for WikiLeaks when he said, \"The DNC heist documentsВ…were hacked and first made public by Guccifer 2.0, almost a month ago, and when that did not get the appropriate traction, he took them to WikiLeaks who then leaked them.\" В Stone also seemed toВ predictВ Podesta's emails would be released as far back as August, suggesting possible collusion.4) According toВ reports,В \"several current and former officials who have worked in the Justice Department,FBI and intelligence community said they have little doubt federal law enforcement is looking into the different questions surrounding the different current and one-time Trump campaign operatives.5) Julian Assange's own ties to the Kremlin are extensive and well-documented: AssangeВ hosted a talk showВ on Putin's propaganda network, RT. Forbes:В The Breathtaking Hypocrisy of Julian Assange, Kremlin Pawn A recentВ New York Times examinationВ of Assange's time in exile found that WikiLeaks' activities have consistently benefitted Putin's Russia at the expense of America and our allies. National security experts have criticized Assange and WikiLeaks for doing Putin's bidding by releasing documents obtained by Russian hackers: Defense One: How Putin Weaponized Wikileaks to Influence the Election of an American President:\"Considerable evidence shows that the Wikileaks dump was an orchestrated act by the Russian government, working through proxies, to undermine Hillary Clinton's Presidential campaign.\" Former NSA analyst and counterintelligence officer, John Schindler:В \"Russian hackers working for the Kremlin cyber-pilfered the DNC then passed the purloined data, including thousands of unflattering emails, to Wikileaks, which has shown them to the world. This, of course, means that Wikileaks is doing Moscow's bidding and has placed itself in bed with Vladimir Putin.\" National Security expert Michael Weiss:В \"In a bizarre mind-meld that could only happen today, the WikiLeaks founder is refusing to say whether he got the hacked DNC emails from Russia, and Trump is defending Putin.\"6) Trump wasВ reportedlyВ briefed by U.S. intelligence officials before the last debate that Russian intelligence services were behind the hacks.В Despite that information, Trump stood on the debate stage and claimed to 80 million Americans that it could be anyone including someone \"sitting in their bed who weighs 400 pounds.\" Why? NBC News:В \"A senior U.S. intelligence official assured NBC News that cybersecurity and the Russian government's attempts to interfere in the 2016 election have been briefed to, and discussed extensively with, both parties' candidates, surrogates and leadership, since mid-August. 'To profess not to know at this point is willful misrepresentation,' said the official. 'The intelligence community has walked a very thin line in not taking sides, but both candidates have all the information they need to be crystal clear.'\" WaPo:В Headline:В \"Trump refusal to accept government assessments on Russian hacks dismays former officials\" \"The former officials, who have served presidents in both parties, say they were bewildered when Trump cast doubt on Russia's role after receiving a classified briefing on the subject and again after an unusually blunt statement from U.S. agencies saying they were \"confident\" that Moscow had orchestrated the attacks.\"7) Donald Trump himselfВ encouragedВ Russian hackers to spy MORE on Hillary Clinton:\"Russia, if you're listening, I hope you're able to find the 30,000 emails that are missing,\" Trump said. \"I think you'll be rewarded mightily by our press!\"8) Trump's business interests in Russia run deepВ…and present HUGE conflicts of interest.В Because Donald Trump won't release his taxes, the full extent of his Russian business interests that could conflict with American national security interests is largely unknown. But just some of the recent headlines have revealedВ hundreds of millionsВ of dollars related to Russian business interests; connections to business groups with ties to the Kremlin likeВ Bayrock;В business dealings with alleged Russian mobsterВ Felix SaterВ and aВ 30-year historyВ of pursuing business with Russia including the Miss Universe pageant. Trump's son has said that \"Russians make up a pretty disproportionate cross-section\" of the Trump Organization's assets and that \"we see a lot of money pouring in from Russia.\"9) Trump's policies are concerning experts because they align closely with Putin's agenda, contrary to American interests. Op-ed by Former U.S. Ambassador to Russia, Michael McFaul:\"Putin has rational motives for wanting Trump to win: Trump champions many foreign policies that Putin supports. Trump's most shocking, pro-Kremlin proposal is to \"look into\" recognition of Crimea as a part of RussiaВ…. Trump has demanded that other NATO members essentially pay us for protectionВ… Trump has also disparaged our allies in Asia, creating new opportunities for Russian influenceВ…. On the whole, Trump advocates isolationist policies and an abdication of U.S. leadership in the world. He cares little about promoting democracy and human rights. A U.S. retreat from global affairs fits precisely with Putin's international interests.\" Vox:Trump's policies are objectively pro-Russia.В \"Nothing Russia could do, on its own, would help its foreign policy more than what Trump is proposing. He is literally suggesting the United States transform global politics to make it more favorable to Russian interests.\" Slate:Putin's Puppet:В If the Russian president could design a candidate to undermine American interestsВ—and advance his ownВ—he'd look a lot like Donald Trump.В \"Donald Trump is like the Kremlin's favored candidates, only more so. He celebrated the United Kingdom's exit from the EU. He denounces NATO with feeling. He is also a great admirer of Vladimir Putin.\" Politifact:\"Trumps [sic] comments on backing away from NATO, supporting Russia on the Ukraine and rethinking sanctions against Russia certainly qualify as statements that dovetail with what the Putin administration would like.\"10) Former Acting CIA Director Michael Morrell hasВ concluded,В \"In the intelligence business, we would say that Mr. Putin had recruited Mr. Trump as an unwitting agent of the Russian Federation.\"11) The Trump campaign's ties to Russia are deeply disturbing. One-time Foreign Policy Adviser Carter Pageis beingВ probed by U.S. intelligence agenciesВ for meeting with sanctioned Kremlin officials including Igor Diveykin.\"A former Russian security official, Diveykin now serves as deputy chief for internal policy and is believed by U.S. officials to have responsibility for intelligence collected by Russian agencies about the U.S. election, the Western intelligence source said.\" The Trump campaignliedВ about Page having \"never been a part of our campaign. Period\" to cover up his involvement. In fact, Trump announced PageВ himselfВ to Washington Post editorial board back in March 2016 as one of his foreign policy advisers, which was confirmed by Trump spokeswoman Hope Hicks to CNN. Campaign Chair Paul Manafortwas forced to resign after theВ New York Timesrevealed,В \"Handwritten ledgers show $12.7 million in undisclosed cash payments designated for Mr. Manafort from Mr. Yanukovych's pro-Russian political party from 2007 to 2012В…Investigators assert that the disbursements were part of an illegal off-the-books system whose recipients also included election officials.\"  Gen. Michael Flynn, the adviser who joined Trump for his classified intelligence briefing, has beenpaidВ by Kremlin-run RT and satВ two seats downfrom Putin at the outlet's 10th anniversary gala.В \"The presence of such an important figure at Putin's table startled current and former members of the Obama administration. 'It was extremely odd that he showed up in a tuxedo to the Russian government propaganda arm's party,' one former Pentagon official told me. Like Trump, Flynn has advocated forging closer ties with Russia.\" Mike McSherry, an aide who helped lead Trump's convention strategy, worked alongside Manafort and Gatesto lobbyВ for Putin puppet Yanukovych. Howard Lorber, a Trump economic adviser, traveled with Trump to Moscow in the 1990s seeking real estate deals.Lorber was just the the \"latest in aВ long listВ of relationships that give Trump a financial stake in warm U.S.-Russian relations.\" Boris Epshteyn,a senior Trump adviser and surrogate, moderated a 2013 forum at the \"Invest In Moscow!\" Conference and has echoed Kremlin talking points on TV.В As a surrogate for Donald Trump's campaignВ he arguedВ that Russia has not seized Crimea from Ukraine, even though Vladimir Putin seized the region more than two years ago. While discussing the GOP nominee's recent remarks about Putin on CNNВ Sunday, campaign surrogate Boris Epshteyn said, \"First of all, Russia did not seize Crimea.\" Richard Burt,who has been an adviser to Trump andВ helpedВ write his first major foreign policy speech, has deep ties to Russia as well. BurtВ sits on the board of directorsfor the US-Russia Business Council, formerlyВ sat on the senior advisory boardВ of Russia's Alfa Bank, andВ has argued againstВ S. sanctions on Russia. Michael Caputo,a former top Trump adviser who also recently resigned, had acontractВ with Russian conglomerate Gazprom Media in 2000 to improve Putin's image in the United States.12) Trump allies, WikiLeaks and RussiaВ pushedВ a nonsensical conspiracy theory about the DNC hacks.В \"Trump campaign surrogates are fueling a conspiracy theory that a murdered Democratic National Committee staffer was connected to the hacking of the DNC, a theory being pushed by WikiLeaks and the Russian state-controlled press.В Some experts have gone as far as to say that Putin is explicitly using Trump to further his agenda.\"13) Even top Republicans have raised serious concerns about Trump's relationship with Putin's Russia. 50 G.O.P officialsВ warnedВ that Donald Trump would put the nation's security at risk:В \"They viewed Mr. Trump's comments on NATO as an abandonment of America's most significant alliance relationship. Mr. Trump has said throughout his campaign that he intends to upend Republican foreign policy orthodoxy on everything from trade to Russia, where he has been complimentary of President Vladimir V. Putin, saying nothing about its crackdown on human rights and little about its annexation of Crimea.\"14) Top Democrats on four House committees that oversee national securityВ on FridayВ called on the FBI to investigateВ Donald Trump's purported ties to the Russian government and its alleged hacking of Democratic groups and operatives.15) Trump has praised Putin for a decade, and Putin has returned the favor. Trump, 2007:\"[Putin's] doing a great job. In rebuilding the image of Russia and also rebuilding Russia period. Forget about image.\" Trump, 2011:\"I often speak highly [of Putin] for his intelligence and no-nonsense wayВ…. Putin has also announced his grand vision: the creation of a 'Eurasian Union' made up of former Soviet nations that can dominate the region. I respect PutinВ…\" Trump, 2013,on Putin's NYTВ op-edВ denouncing American exceptionalism:В \"I thought he did an amazing jobВ…. He's making him look like a -- he's the professor and the President is a school childВ… He really becomes with this letter, almost, the world leader\" Trump, 2013:\"Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend?\" Washington Poston Trump's 2013 Miss Universe Contest in Moscow:В \"Putin canceled at the last minute, but he sent a decorative lacquered box, a traditional Russian gift, and a warm note\" Trump, 2014:\"Putin has become a big hero in Russia with an all time high popularity.\" Trump, 2015:\"In terms of leadership, [Putin's] getting an 'A,' and our president is not doing so well.\" Putin, 2015on Trump:В \"He's a really brilliant and talented person, without any doubt.\" Trump, 2016:\"[Putin] called me a genius, I'm going to disavow it? Are you crazy? Can you believe it? How stupid are they.\" AP, 2016:Russia's Putin Reaffirms Praise for Trump, Calling Him 'Bright'", "title": "Clinton Campaign Statement on Donald Trump's Comments on Meeting with Putin"}
