{"date": "2016-03-14", "text": "Throughout her campaign,В HillaryВ Clinton has challenged attempts by coal companies, includingВ Patriot Coal,В Peabody Energy,В Alpha Natural Resources, andВ Walter EnergyВ to use bankruptcy courts to shirk their responsibilities to retired coal miners and dependents.В While under pressure some of these companiesВ haveВ sinceВ reversed course, a federal backstop is required to protect coal miners, their families, and their communities.В Hillary Clinton has called for such a backstop as part of herВ plan to revitalize coal communities.On Monday, she affirmed her commitment to this plan by issuing the following statement:\"I firmly believe that if you spent your life keeping the lights on for our country, we can't leave you in the dark.В In this campaign, I've talked a lot about the United States becoming the clean energy superpower of the 21stВ century. We're not going to make that happen without a sensible transition that works for people and for our country. We need to use every tool we have to build a 21stВ century energy future that doesn't leave anyone out or behind.\"That includes supporting safe and responsible natural gas production and nuclear energy, and the thousands of jobs that come with it, including good-paying union jobs. Proposals to end natural gas production or rapidly shut down our nation's nuclear power fleet put ideology ahead of science and would make it harder and more costly to build a clean energy future.\"And it means we need to support our coal miners, their families, and their communities. Coal will remain a part of the energy mix for years to come, and we have a shared responsibility to ensure that coal communities receive the benefits they have earnedВ—and can build the future they deserve. That's what my plan does, by safeguarding retirement and healthcare benefits and school funding, creating good-paying jobs in infrastructure, reclaiming and repurposing abandoned mining sites, expanding broadband, and investing in hydropower and clean energy. And I will launch a Coal Communities Challenge Fund to support the locally-driven economic development in health care, housing, and small business that is happening by coal communities, for coal communities.\"", "title": "Clinton Touts Comprehensive Plan To Revitalize Coal Communities"}
