{"date": "2007-09-18", "text": "Clinton Health Plan Will Reduce Health Disparities ARLINGTON, VA - Millions of African Americans will benefit from the American Health Choices Plan released this week by Senator Hillary Clinton. The Democratic presidential candidate's health plan provides comprehensive health care for all Americans, reduces health care costs for working families and strengthens the safety net for low income Americans. Under the plan, 7.7 million African Americans without health insurance will receive high quality, affordable care. Senator Clinton's health plan will vastly improve access to preventive measures that slow the onset of diseases, as well as allow millions of African Americans access to better medical care. African Americans suffer disproportionately from chronic illnesses, such as diabetes certain cancers and heart disease. \"My plan will address health disparities by providing preventive, affordable, high quality care for all African Americans,\" said Hillary Clinton. Under the American Health Choices Plan, tax credits will be available to help working families cover healthcare costs and insurance companies will no longer be permitted to deny coverage for a pre-existing or genetic condition. For people who change jobs, under the Clinton plan they will not lose their healthcare coverage. Specifically, the plan will:   Allow everyone who is satisfied with their health care to keep it; Provide new options for those who are not insured or are not satisfied with their insurance; End insurance discrimination; and Allow consumers to keep their health coverage if they change jobs  Senator Clinton said that her health plan will address health disparities that strike many African Americans. Senator Clinton said that her health plan will address health disparities that strike many African Americans. She has the strength and experience to bring about the change that is needed to improve the quality of health care and coverage for African Americans. The following report is one in a series that the campaign will release to demonstrate how Clinton's American Health Choices Plan will impact various communities. The American Health Choices Plan: Ensuring African Americans Get the Care They Need Guaranteed Health Care Coverage for All African Americans If you are one of the seven million seven hundred thousand African Americans without health insurance, this plan will provide high quality health care coverage at a cost you can afford. You will be able to buy into the same health insurance program Members of Congress receive, which includes plans that cover prevention services that significantly increase the chance of catching diseases early, as well as mental health services and dental care in most cases. You will also have access to a new public option like Medicare. If you are one of the 18.4 million African Americans with employer-sponsored coverage, this plan will provide you with more security, and allow you to pay less and receive higher quality coverage. You will no longer have to worry about losing your coverage if you change jobs, and you will not be denied coverage based on a pre-existing or genetic condition. Insurance companies will have to renew each plan at an affordable price. Coverage will also be portable for those who change jobs, but want to maintain the same plan through the new menu of health choices. If you are part of the 45 percent of African American children or the 19 percent of African American adults participating in the Children's Health Insurance Program or Medicaid, this plan will fix the holes in the safety net to ensure that you receive affordable, quality care. Public hospitals and community health centers will also continue to receive support to serve vulnerable populations. Twenty five percent of African American men are uninsured and 21 percent do not have a usual source of health insurance, in part, because they are not eligible for Medicaid. This plan will expand Medicaid eligibility to childless adults. Universal Coverage: Our Best Weapon Against Racial Health Disparities.", "title": "Clinton Health Plan Will Provide Quality Health Care and Coverage for All African Americans"}
