{"date": "2007-09-19", "text": "Clinton Health Plan Will Reduce Health Disparities Millions of Hispanics will benefit from the American Health Choices Plan released this week by Hillary Clinton. Out of any racial or ethnic group, Latinos have the highest rate of uninsured; the American Health Choices Plan will help millions of Latinos to have access to high quality, affordable health coverage. The plan will provide the 17.9 million Latinos with employer-sponsored coverage with more security and allow them to pay less and receive higher quality coverage. The plan will also fix the holes in the safety net for the 9.6 million Latinos participating in Medicaid, to ensure that they receive affordable, quality care. In addition, the American Health Choices Plan will eliminate racial and ethnic disparities in health care, and increase diversity and cultural and linguistic competency in the health care system. \"I believe it is long past time that this nation had an answer to the health crisis that we face,\" said Hillary Clinton. \"I believe America is ready for a change that will allow Latinos and indeed, all Americans to live longer, healthier lives.\" The American Health Choices Plan creates a premium affordability tax credit that will ensure that no family has to choose between paying their mortgage and paying for health care. Insurance companies will no longer be allowed to deny coverage for a pre-existing or genetic condition. Under the Clinton plan, people who change jobs will not lose their healthcare coverage. Specifically, the plan will:  Allow everyone who is satisfied with their health care to keep it; Provide new options for those who are not insured or are not satisfied with their insurance; End insurance discrimination; and Allow consumers to keep their health coverage if they change jobs  The following report is one in a series that the campaign will release to demonstrate how Clinton's American Health Choices Plan will impact various communities. The American Health Choices Plan:Impact on Hispanics", "title": "Clinton Health Plan Will Provide Quality Health Care and Coverage for Millions of Hispanics"}
