{"date": "2007-12-26", "text": "  Madeleine K. Albright - Secretary of State    J. Brady Anderson - Administrator, USAID    Christopher Ashby - Ambassador to Uruguay    Ronald D. Asmus - Deputy Assistant Secretary of State for European Affairs    Harriet C. Babbitt - Administrator, USAID    Elizabeth Frawley Bagley - Ambassador to Portugal    Lt. Gen. Joseph Ballard, Commander, US Army Corps of Engineers    John P. Barker - Deputy Assistant Secretary of State for Nonproliferation Controls    Judith Barnett - Deputy Assistant Secretary for Middle East and North Africa, Department of Commerce    Charlene Barshefsky - U.S. Trade Representative    Daniel Benjamin - Director for Transnational Threats, NSC    James Blanchard - Ambassador to Canada    Susan Braden - Director for Central and Eastern Europe, NSC    Karen Brooks - Director for Asian Affairs, NSC    Amy L. Bondurant - Ambassador to the OECD    Edward P. Brynn - Ambassador to Ghana    Louis Caldera - Secretary of the Army    Kurt Campbell - Deputy Assistant Secretary of Defense for Asia and the Pacific    Ashton Carter - Assistant Secretary of Defense for International Security Policy    Barry Carter - Deputy Under Secretary for Export Administration, Commerce Department    Sheila Cheston - General Counsel, Department of the Air Force    Timothy Chorba - Ambassador to Singapore    Edward Chow, Jr. - Deputy Assistant Secretary for Policy, Veterans Affairs    Warren Christopher - Secretary of State    General Wesley Clark - Supreme Allied Commander Europe, NATO    PJ Crowley - Special Assistant to the President and Senior Director for Public Affairs, NSC    Daniel Cruise - Director of Public Affairs, NSC    John Dalton - Secretary of the Navy    William Danvers - Special Assistant to the President and Senior Director for Legislative Affairs, NSC    Rudy de Leon - Deputy Secretary of Defense    Thomas E. Donilon - Chief of Staff to the Secretary of State, and Assistant Secretary of State for Public Affairs    John Douglass - Assistant Secretary of the Navy    Tyler Drumheller - Europe Division Chief, Directorate of Operations, CIA    Robin Chandler Duke - Ambassador to Norway    Laura Efros - Director, International Economic Affairs, NSC    Robert J. Einhorn - Assistant Secretary of State for Nonproliferation    Stuart Eizenstat - Deputy Secretary of the Treasury    Lee Feinstein - Principal Deputy Director, Policy Planning Staff, State Department    Daniel Feldman - Director of Multilateral and Humanitarian Affairs, NSC    Thomas Foley - Ambassador to Japan    Richard Fredericks - Ambassador to Switzerland    Edward E. Gabriel - Ambassador to Morocco    Peter Galbraith - Ambassador to Croatia    Suzy George - Deputy Chief of Staff, State Department    Gordon Giffin - Ambassador to Canada    Marc C. Ginsberg - Ambassador to Morocco    Hershel Gober - Acting Secretary of Veterans Affairs    Matthew Gobush - Deputy Spokesman, NSC    Gabriel Guerra-Mondragon - Ambassador to Chile    David L. Goldwyn - Assistant Secretary of Energy for International Affairs    Ernie Green - Chair, African Development Foundation    Maria Haley - Board Director, Export-Import Bank of the United States    Nina Hachigian - Special Assistant to the Deputy National Security Advisor    Morton H. Halperin - Director, Policy Planning Staff, State Department    Ruth Harkin - President, Overseas Private Investment Corporation    Anthony S. Harrington - Ambassador to Brazil    Richard C. Holbrooke - Permanent Representative to the United Nations    Stephen Honigman - General Counsel of the Navy    Donna Hrinak - Ambassador to Venezuela    Swanee G. Hunt - Ambassador to Austria    Robert Hunter - Ambassador to NATO    Karl F. Inderfurth - Assistant Secretary of State for South Asian Affairs    Lionel Johnson - Deputy Assistant Secretary of the Treasury for International Development    James R. Jones - Ambassador to Mexico    Robert Jones - Deputy Assistant Secretary of Defense    Jan Kalicki - Counselor to Department of Commerce    Paul G. Kaminski - Under Secretary of Defense for Acquisition and Technology    Mickey Kantor - Secretary of Commerce    Mary Lou Keener - Deputy Assistant Secretary of the Air Force    Lt. Gen. Donald Kerrick, Deputy National Security Advisor    John Kornblum - Ambassador to Germany    Franklin D. Kramer - Assistant Secretary of Defense for International Security Affairs    Bob Kyle - Associate Director for National Security and International Affairs at the Office of Management and Budget    Philip Lader - Ambassador to United Kingdom    Vinca LaFleur - Special Assistant to the President and Director for Speechwriting, NSC    Carol Lancaster - Deputy Administrator, USAID    Luis Lauredo - Ambassador to the Organization of American States    David Leavy - Special Assistant to the President and Senior Director for Public Affairs, NSC    Jonathan Levitsky - Counselor to the Permanent Representative, USUN    Kenneth Lieberthal - Special Assistant to the President and Senior Director for Asian Affairs, NSC    Evelyn S. Lieberman - Under Secretary of State for Public Diplomacy and Public Affairs    Theresa Loar - Senior Coordinator for International Women's Issues, State Department    James Lyons - Special Advisor to the President and Secretary of State for Economic Initiatives in Ireland and Northern Ireland    Alphonso Maldon - Assistant Secretary of Defense for Force Management and Personnel    Charles T. Manatt - Ambassador to Dominican Republic    Michelle Manatt - Director of Legislative Affairs, Office of National Drug Control Policy    Mack McLarty - Special Envoy for the Americas    Tom McDonald - Ambassador to Zimbabwe    Gerald McGowen - Ambassador to Portugal    Mark Medish -Special Assistant to the President and Senior Director Russian, Ukrainian and Eurasian Affairs, NSC    Johanna Mendelson-Forman - Senior Policy Advisor, Bureau for Humanitarian Response, USAID    William Green Miller -    Judith Miller - General Counsel, Department of Defense    Walter F. Mondale - Ambassador to Japan    Richard L. Morningstar - Ambassador to European Union    George Munoz - President, Overseas Private Investment Corporation    Marc Nathanson - Chairman, Broadcasting Board of Governors    Joseph Nye - Assistant Secretary of Defense for International Security Affairs    David Ohrenstein - Senior Advisor, Export-Import Bank   В В В  Paul Orzulak - Director for Speechwriting, NSC   В В В  Joseph Paolino - Ambassador to Malta   В В В  Hugh Palmer - Assistant Administrator, Food and Humanitarian Assistance, USAID   В В В  Robert Perreault - Director, Medical Administration, Department of Veterans Affairs   В В В  William J. Perry - Secretary of Defense   В В В  Jan Piercy - Executive Director, World Bank   В В В  Jack Pritchard - Senior Director for Asian Affairs, NSC   В В В  Joseph Reeder - Secretary of the Army   В В В  Anne Richard - Director, Office of Resources, Plans and Policy, State Department   В В В  Steve Ricchetti - Deputy Chief of Staff, White House   В В В  Kirk Robertson - Executive Vice President, Overseas Private Investment Corporation   В В В  Lula Rodriguez - Deputy Assistant Secretary of State for Public Affairs   В В В  Peter F. Romero - Assistant Secretary of State for Western Hemisphere Affairs   В В В  James C. Rosapepe - Ambassador to Romania   В В В  Tom Rosshirt - Director for Speechwriting, NSC   В В В  Stanley O. Roth - Assistant Secretary of State for East Asian and Pacific Affairs   В В В  David Rothkopf - Acting Under Secretary of Commerce for International Trade   В В В  James P. Rubin - Assistant Secretary of State for Public Affairs   В В В  Mara Rudman - Deputy National Security Advisor   В В В  Peter Rundlet - Associate Counsel to the President; Counsel, 9/11 Commission   В В В  Richard Schifter - Special Assistant to the President and Counselor, NSC   В В В  Cynthia P. Schneider - Ambassador to Netherlands   В В В  Arthur L. Schechter - Ambassador to the Commonwealth of the Bahamas   В В В  Jill Schuker - Special Assistant to the President and Senior Director for Public Affairs, NSC   В В В  Vice Admiral Joseph A. Sestak, Jr., Director, Defense Policy, NSC   В В В  Stephen Sestanovich - Ambassador-at-large and Special Advisor to the Secretary of State for the New Independent States   В В В  General John M. Shalikashvili - Chairman Joint Chiefs of Staff   В В В  John Shattuck - Assistant Secretary of State for Democracy, Rights and Labor   В В В  Derek Shearer - Ambassador to Finland   В В В  Wendy R. Sherman - Special Advisor to the President and Secretary of State, and North Korea Policy Coordinator   В В В  Elizabeth Sherwood-Randall - Deputy Assistant Secretary of Defense for Russia, Ukraine and Eurasia   В В В  Susan Shirk - Deputy Assistant Secretary of State for East Asian and Pacific Affairs   В В В  Elaine K. Shocas - Chief of Staff to the Secretary of State   В В В  Terry Shumaker - Ambassador to Trinidad and Tobago   В В В  Thomas L. Siebert - Ambassador to Sweden   В В В  Steven Simon - Senior Director for Transnational Threats, NSC   В В В  Jeffrey Smith - General Counsel, CIA   В В В  Gene Sperling - Assistant to the President for Economic Policy and Director, National Economic Council; Leading expert on global education   В В В  Daniel L. Spiegel - U.S. Permanent Representative to the UN in Geneva   В В В  Carl Spielvogel - Ambassador to the Slovak Republic   В В В  Joan E. Spero - Under Secretary of State for Economic Affairs   В В В  Paula Stern - Chairwoman, U.S. International Trade Commission   В В В  Todd D. Stern - Assistant to the President and Staff Secretary and Counselor to the Secretary of the Treasury   В В В  Ambassador James Sweeney - Special Representative of the President for Arms Control and Nonproliferation   В В В  John Tedstrom - Director for Russian, Ukrainian, and Eurasian Affairs, NSC   В В В  Laura Tyson - Assistant to the President for Economic Policy and Director, National Economic Council   В В В  Arturo Valenzuela - Special Assistant to the President and Senior Director for Inter-American Affairs, NSC   В В В  Vanessa Weaver - Governing Member of the Board, Export-Import Bank   В В В  Toni G. Verstandig - Deputy Assistant Secretary of State for Near Eastern Affairs   В В В  Melanne Verveer - Assistant to the President and Chief of Staff to the First Lady   В В В  William Wechsler - Director for Transnational Threats, NSC   В В В  Togo D. West, Jr. - Secretary of Veterans Affairs   В В В  Andrew S. Weiss - Director for Russian, Ukrainian and Eurasian affairs, NSC   В В В  Maureen White - U.S. Representative to UNICEF   В В В  Ted Widmer - Director for Speechwriting, NSC   В В В  Sheila Widnall - Secretary of the Air Force   В В В  Doug Wilson - Principal Deputy Assistant Secretary of Defense for Public Affairs   В В В  Joseph C. Wilson - Special Assistant to the President and Senior Director for African Affairs, NSC   В В В  Jonathan Winer - Deputy Assistant Secretary of State for International Law Enforcement   В В В  Jon Wolfsthal - Special Policy Advisor to the Office of Arms Control and Nonproliferation, Department of Energy   В В В  Lee Wolosky - Director for Transnational Threats, NSC    * Denotes Positions held during Clinton Administration ", "title": "Former Clinton Administration Officials Supporting Senator Clinton*"}
