{"date": "2007-09-18", "text": "A day after announcing Hillary's plan to provide quality health care for all Americans, Hillary Clinton for President released a report on the plan's impact on women and children. The American Health Choices Plan will provide guaranteed, high-quality health care for all - including the 21.5 million women and 8.7 million children without insurance. The report is one in a series that the campaign will release to demonstrate how her American Health Choices Plan will impact different communities. \"This plan will help all Americans - but it will especially make a difference for women in our country who are more likely to be caregivers and health care gatekeepers for their families,\" said Clinton. \"Compared with men, women are less likely to have employer-sponsored health care coverage and are also more likely to be covered as dependents on their spouses' employer-sponsored health plans. As a result, women are more vulnerable to losing their coverage if they are widowed or divorced.\" Women who are satisfied with their health insurance will be able to keep it. They will experience no change in their health care except that the modernization and quality initiatives in the plan will improve the quality of care and lower the cost of care for everyone. Women who are not satisfied with their health care or who do not have access to health care will be able to choose from a wide variety of plans at an affordable cost. \"As someone who has worked in the women's health field my entire career, I know too well that overall health care reform is central to women's health because it is women who are most likely to be uninsured or underinsured,\" said Susan F. Wood, Ph. D., former Assistant Commissioner for Women's Health for the U.S. Food & Drug Administration and current professor of Public Health at George Washington University. \"This plan will make high-quality affordable health care available to all women and families. We have been fighting to cover all women and children for so many years, and with Hillary Clinton's plan and her leadership, we can actually accomplish this important goal.\" During her speech on Monday announcing her plan, Hillary Clinton discussed the stories of two women in the audience, Judy Rose and Lisa Scott. After Judy's husband John lost his job and health insurance, she was diagnosed with breast cancer. She was able to get the treatment she needed but then after her husband had a heart attack, their medical bills became too high and they were forced to sell their home. Lisa Scott lost her 18-year old daughter, Janelle, because Janelle did not have health insurance and could not afford to get treated for her chest pains and black outs. \"For so many years I have listened to stories like those of Judy and Lisa. I carry these stories with me everyday,\" said Clinton. \"As we strive for a new beginning to the 21st century, I believe everyone, every man, woman and child, should have quality, affordable health care in America. We should do it.\" The American Health Choices Plan: Ensuring Women Get the Care They Need Covering Everyone, Helping Women Under the American Health Choices Plan, every woman will be covered regardless of employment or marital status. If you are one of the 21.5 million uninsured women or 8.7 million uninsured children in America,", "title": "Hillary's Health Care Plan Will Ensure Women Get the Care They Need"}
