{"date": "2007-10-25", "text": "956,000 private-sector Nevada workers could have access to paid family leave Last week, Hillary Clinton announced an agenda to help parents balance work and family and ensure that Americans aren't faced with a choice between keeping their jobs and caring for a newborn baby. Her plan will extend the Family Medical Leave Act to cover 13 million additional workers across the country, and will ensure that the 635,000 Nevadans who do not receive paid sick days will receive a minimum of seven days a year. Hillary's plan would set an ambitious goal for all states to implement a paid family leave program by the year 2016, and offer $1 billion per year in grants to encourage innovative paid family leave programs at the state level. About 956,000 private-sector workers in Nevada could benefit from paid family leave by ensuring they receive the time off they need to care for their families. \"Too many Americans feel trapped between being a good parent and being a good worker,\" Clinton said. \"It's about time we stopped just talking about family values and started pursuing policies that truly value families. All Americans who are working hard and taking responsibility deserve the chance to do right by their children. \"With sound policies and sensible investments, we can give parents more choices to make the decisions that are best for them. We can make life a little easier for everyone – for mothers and for fathers – to do the most important job there is in any society: raising and nurturing the next generation. And that's the right decision for all of us.\" Access to quality, affordable child care is critical for parents seeking to fulfill their work and family obligations. With 300,000 children set to lose access to child care by 2010, Hillary's plan would increase child care funding through the Child Care and Development Block Grant and foster public-private partnerships to expand child care options at the state level. This bold new effort will give families the support they need to more effectively balance work and family obligations. And it will work in partnership with America's businesses to ensure that pro-family work policies and increasing workplace flexibility helps improve American competitiveness and economic growth. The following details how Senator Clinton's plan to help balance work and family will benefit thousands of Nevada's families.  Hillary Clinton's Agenda for Working Families: Helping Nevada's Parents Balance Work & Family ", "title": "Hillary Clinton's Agenda for Working Families: Helping Nevada Parents Balance Work & Family"}
