{"date": "2007-10-10", "text": "Merrimack, New Hampshire – Today, Hillary Clinton laid out innovation policies that will create the jobs of the future, stimulate economic growth, and ensure American leadership in new industries. Hillary's speech builds on the innovation agenda she announced earlier in the year, which will be critical to creating new, high-wage jobs in our global economy. Innovation is part of the economic blueprint for the 21st Century that Hillary is laying out this week to rebuild America's middle class. \"Americans are concerned about the global economy – and the policies of this administration have only made matters worse. I believe we need a new beginning to the 21st century, and a new economic blueprint. The core of my plan is creating the high wage jobs of the future – and we'll do that by restoring our role as the world's innovation superpower. That's what America does best. This country was built on innovation,\" Clinton said. \"As president, I will lead our nation to create millions of new jobs by investing in clean energy and doubling investments in basic and applied research. I'll implement a national strategy to bring broadband – and the information economy – to every corner of our country. I'll improve math and science education, and open up science and engineering to more of our people. And I'll end the assault on science waged by the Bush Administration. \"As we enter this new world of economic, technological, and social change – our dedication to innovation will be more important than ever. It will be the key to creating new jobs, to harnessing globalization and to rebuilding the road to middle class prosperity.\" Hillary's Innovation Agenda Will:  Establish a national broadband strategy called Connect America Create a $50 billion Strategic Energy Fund Double the budget for basic and applied research at major federal agencies, and encourage more high-risk, high-reward projects Strengthen education from pre-K to post-graduate study Make the R&E; tax credit permanent Restore integrity to science policy by ending the Bush Administration's war on science ", "title": "Hillary Clinton's Innovation Agenda: Rebuilding the Road to the Middle Class"}
