{"date": "2007-10-03", "text": "Expanding opportunity is at the core of the American dream. We believe that if we work hard and play by the rules, we can succeed and create better lives for ourselves and our children. Latinos understand and value the importance of opportunity - a good education system and good jobs. EDUCATIONAL OPPORTUNITY  That is why Hillary Clinton has an agenda that expands opportunity for Latinos. It starts with closing the early achievement gap; she will help address it by ensuring every child in America enters school ready to learn. As President, Hillary Clinton will:  Invest $10 billion in quality pre-kindergarten. Hillary will provide access to high quality pre-kindergarten for all four-year-olds through a federal-state partnership. Her proposal pays particular attention to the need for these programs among children from limited-English and/or low income households - ensuring that they receive priority in enrollment and receive these services at no cost. Currently, only 40 percent of three-to-five-year-old Hispanics attend pre-k compared to about 60 percent of whites and blacks, in large part because pre-k isn't available or the price is out of reach in many Hispanic communities. One study of Tulsa, Oklahoma's pre-k-for-all program found benefits for all racial, ethnic, and socio-economic status groups but the gains for Hispanic students were especially impressive. Hispanic students experienced a 79 percent gain in letter-word identification (compared to 52 percent for whites), a 39 percent gain in spelling (compared to 26 percent for whites), and a 54 percent gain in applied problem solving (compared to 6 percent for whites). Expand Head Start and Early Head Start. Hillary is proud to have helped create Early Head Start when she was First Lady and to have worked toward doubling it as a Senator. As President, She will continue to expand access to Head Start for the children of farm workers; end the underrepresentation of Latino children in Head Start and Early Head Start; ensure that assessments of children's growth and development are culturally and linguistically appropriate; and grow the programs overall to increase school readiness of Latino children. Expand parent support programs. Hillary will also expand innovative nurse home visitation and parent education programs, such as Parents as Teachers and the Nurse Home Visitation Program, to help first-time mothers prepare for and care for their young children. One analysis of the Parents as Teachers program in Northern California found that this program improved children's cognitive, social, emotional skills even more so among children in Spanish-speaking Latino families than others.  But school readiness is just the beginning. We also need to do better by Hispanic children throughout the education pipeline so that they can realize their dreams and aspirations. That means raising achievement, closing the achievement gap, focusing on the drop out crisis and getting all Latino children to college. As President, Hillary Clinton will:  Set a big goal of cutting the Latino drop-out rate in half. The Latino dropout rate is far too high - half of all Latino kids don't graduate from high school on time. Hillary has supported the Graduation Promise Act, which makes a $2.5 billion investment to stop what have become known as \"high school drop out factories.\" Two thousand of these drop-out factories nation-wide produce the majority of our high school dropouts. The dropout rate for Hispanics is more than double the rate for African Americans and more than three times the rate for whites. Expand GEAR UP to provide mentoring to Latino children. Many at-risk youth are falling off the track to higher education and career success early in the middle school years because they lack the tools and positive role models to get ahead. GEAR UP supports innovative partnerships between local school systems, colleges, businesses, and non-profit organizations to provide over a million middle-school students in high-risk schools with comprehensive college-readiness services including tutoring, mentoring, and college visits. Hillary will increase by 50 percent the number of children being served by GEAR UP. Put college within reach for more Hispanic families. Only 12 percent of Hispanics eventually earn a bachelor's degree, compared with 33 percent of non-Hispanic whites. College enrollment and completion rates haven't increased over the past 20 years and more members of the freshman class at the University of Michigan have parents making at least $200,000 a year than have parents making less than the national median of $53,000. For Latinos, cost can be a major barrier; the total cost of public college tuition is one-third of the median household income compared with 24 percent for white students. Hillary will make a firm commitment to make college affordable when she is President. She will end the work penalty that discounts students' financial aid packages by as much as 50 percent for each dollar they earn; increase the Pell Grant maximum so that it keeps pace with the rising cost of college; and enact a student borrowers' bill of rights to ensure that loan payments are reasonable. And Hillary will work to increase funding for work-study and other federal financial aid and cut student loan interest rates. Enact the DREAM Act. It will provide a path to citizenship for undocumented children by allowing them to go to college - at the same cost as other state residents for those attending state institutions - or serve in the military. The children of undocumented families often come to the United States at a very early age. They know no other home, and our current policy fails them by providing them no affordable path to college.  As President, Hillary Clinton will also focus on those young people who have traditionally been forgotten. As President, she will:  Help students stay in school and stay on track. Hillary will invest $100 million in a new public/private summer internship program to help one million at-risk middle-school students. Participation in internships teaches young people the value and potential of work and increase the likelihood that they will graduate from high school, go to college and find employment.  Support responsible fatherhood and provide second-chance jobs. Hillary will make sure that states and counties have adequate resources to collect child support and also make sure that these government agencies pass every dollar on to children; research has shown that fathers pay more of their child support and develop deeper bonds with their children if they know that those payments go directly to their children. She will also create new incentive-based re-entry partnership grants - investing $200 million over five years - that will create partnerships between correction facilities, community and religious organizations, community colleges or vocational programs, job placement agencies, and local employers so that all ex-offenders have the opportunity to rebuild their lives. At the end of 2005, there were almost three times as many Hispanic male inmates as whites per capita. Ex-offenders often end up committing crimes again in part because they face steep barriers to entering the legitimate labor market.", "title": "Hillary's Hispanic Agenda: Una Vida Mejor Para Todos"}
