{"date": "2008-02-03", "text": "XM Satellite Radio Channel 130, XM's Presidential Election Channel, POTUS '08, Will Join Hallmark Channel in Airing the Town Hall Live The Clinton campaign today announced hosts and locations for Monday night's \"Voices Across America\" national town hall events in 22 cities. Voters will be able to participate in Hillary's national town hall by attending one of the events and joining the conversation by satellite. Starting at 9 p.m. EST, voters will be able to watch the unprecedented town hall live on Hallmark Channel or at hillaryclinton.com. Voters can also listen to the town hall live on XM Satellite Radio channel 130, XM's presidential election channel POTUS '08. Hillary will anchor the national town hall at an event in New York and Chelsea will host an event in Connecticut. President Bill Clinton and national and local surrogates will host events in other Super Tuesday states. Three-time Emmy award-winning journalist Carole Simpson will join Hillary in New York and moderate the national town hall. \"I invite Americans throughout our country to attend a national town hall event in their community or watch our national town hall on television or online,\" said Clinton. \"Over a year ago, I began a conversation about confronting the challenges we face. With our economy in real trouble and our nation at war, it is more important than ever that voters make an informed decision. During the town hall, I will answer questions from across our nation and detail real solutions to fix our economy, provide health care to every American, and end the war in Iraq.\" LOGISTICS:  Due to space constraints, the main town hall studio in New York will not be available to press. However, all other venues will are open.  Members of the press interested in covering the national town hall can watch it live starting at 9:00 p.m. EST on Hallmark Channel or at www.hillaryclinton.com.  For local station information for Hallmark Channel, visit http://www.hallmarkchannel.com/publish/consumer/home/channel_locator.html. This event is print pool only. To receive the pool report, please email press@hillaryclinton.com.  Broadcast media outlets can access live feed from: AMC 15 Ku DIGITAL TRANSPONDER 03 - CHANNEL D9 ORBITAL SLOT 105 WL DOWNLINK FREQUENCY 11773.5 VERTICAL BANDWIDTH 9 MHz 2100-2230 (9p-1030p Eastern) Hosts and locations for the national town hall events follow:", "title": "Press Release - Clinton Campaign Announces Hosts And Locations For 22 \"Voices Across America\" Town Halls"}
