{"date": "2007-09-19", "text": "DES MOINES, IA – Iowans for Hillary today announced the names of 15 members of Hillary Clinton's Iowa Health Care Professionals Leadership Council and 256 physicians, nurses, health care professionals, and other clinicians who will support Hillary Clinton in the Iowa caucuses because of her unyielding commitment to provide quality, affordable health care to every American. These health care professionals will work within their networks to increase support for Hillary in the caucuses. \"Fourteen years ago, Hillary Clinton's campaign for universal health care spoke to the conscience of our nation. She changed our thinking when she introduced universal health care to America,\" said Former Dean of the University of Iowa College of Nursing Geraldene Felton of Iowa City. \"Everyday families struggle without health care coverage and I'm supporting Hillary Clinton because she has the experience to create the change we need in our health care system.\" \"I'm frustrated when I see families who have lost health insurance and delay treatment until it becomes a medical emergency. Every person deserves healthcare,\" said pediatrician Julie Thomas of Cedar Rapids. \"Without Hillary Clinton, universal healthcare would not even be an issue and I support her because she is the only candidate with the strength and experience to finish the battle.\" \"I am honored to have the support of these dedicated health care professionals,\" Clinton said. \"My plan covers all Americans and improves health care by lowering costs and improving quality. It's a plan that works for America's families and America's businesses, while preserving consumer choices.\" Hillary's American Health Choices Plan fundamentally reforms the nation's health care system by lowering costs, improving quality, and covering all Americans. Building on her prior proposals to rein in costs and to insist on value and quality, yesterday Senator Clinton announced her plan which will secure, simplify and ensure choice in health coverage for every American. Hillary's plan covers every American - finally addressing the needs of the 47 million uninsured and the tens of millions of workers with coverage who fear they could be one pink slip away from losing their health coverage - with no overall increase in health spending or taxes. For those with health insurance, the plan builds on the current system to give businesses and their employees greater choice of health plans - including keeping the one they have - while lowering cost and improving quality. Hillary Clinton has been fighting for children and families for 35 years. In Arkansas, she helped bring health care to thousands of rural families. As First Lady, she fought for health care reform, and has the scars to show for it. But Hillary never gave up. She fought for and helped pass the State Children's Health Insurance Program (SCHIP) which provides health insurance to more than 6 million kids a year nationwide. And as Senator, she fought to expand SCHIP and get 9/11 first responders, veterans and military families the health care they need and deserve. Iowa Health Care Professionals Leadership Council: ", "title": "Press Release - Clinton Campaign Announces Iowa Health Care Professionals for Hillary"}
