{"date": "2007-10-04", "text": "DES MOINES, IA – Iowans for Hillary today unveiled the Iowa Hispanic Leadership Council for Hillary, a group of 27 Hispanic leaders from every corner of the state who support Hillary Clinton. These leaders in the Hispanic community have united behind Hillary because she is the most qualified and experienced candidate to end the war in Iraq, give every American health insurance, and make college more affordable. Across the Hawkeye State, the Hispanic Leadership Council will work to increase Hispanic participation in the caucuses for Hillary. \"In a country as rich as ours, it is unacceptable that people in my community are a pink slip away from being uninsured,\" said Juanita Moreno of Glenwood. \"Hillary Clinton's American Health Choices plan will ensure each and every American has quality, affordable health care, and she is the only candidate with the experience to make it a reality.\" \"Over the past six and a half years, I have witnessed our middle class economy decline and a disastrous war in Iraq,\" said Miguel Moreno of Glenwood. \"Hillary Clinton has the strength and experience to change our course from her first day in the White House and fight for families like mine.\" \"I am thrilled to have the support of these leaders from Iowa's Hispanic community,\" said Senator Clinton. \"Too many Hispanic families have been made to feel invisible to the Bush Administration and when I am president, no American will be invisible.\" Senator Clinton has a long record of fighting for the issues that matter to Latino families. As a young woman, she traveled across south Texas registering Latino voters. As First Lady and Senator, she has fought for investments in job training and child care, an increase in college access for Hispanics, to provide capital and technical assistance to minority-owned businesses, and to end the war in Iraq. On Wednesday, she released \"Una Vida Mejor Para Todos,\" a report that documents the impact that her proposals will have on the Latino community. [Click here] to read the details of Hillary Clinton's Hispanic Agenda: Una Vida Mejor Para Todos Iowa Hispanic Leadership Council for Hillary:  Maria Mercedes Aguilera – Davenport, Scott County LULAC member; Quad Cities Mexican-American Organization member; factory worker who was among the first Latinas to be hired to work at the International Harvester Company Farmall plant in Davenport Luciano Archuleta – Ames, Story County Retired steel mill worker Lydia Casarez – Conesville, Muscatine County Farm worker Cody Eliff – Iowa City, Johnson County President of Students for Hillary, University of Iowa Shelly Escobedo – Fort Dodge, Webster County Webster County activist Gloria Gallaga – Storm Lake, Buena Vista County Buena Vista County activist Oscar Garcia – Muscatine, Muscatine County Veteran, member of the Latino Caucus Julian & Rosario Gutierrez – Davenport, Scott County Julian is a Deacon and both are local activists Argelia Colon Hawley – Eldridge, Scott County Retired educator; Professor Emeritus of the University of Northern Iowa Carmen Hernandez – Dubuque, Dubuque County Public educator; Dubuque County Central Committee member Martha Ives – Waterloo, Black Hawk County Retired nutritionist and caterer Lorenzo Jasso – Des Moines, Polk County Elementary school principal Sandra Armenta Leyva – Storm Lake, Buena Vista County Interpreter and community activist Fedelina Madrid, MBA – Independence, Buchanan County Vice president for marketing and communications for a private Iowa University; marketing and communications executive with over 16 years of fortune 500 experience with national and global responsibilities; consultant for the Nigerian Institute for International Affairs Teresa Martinez – Cedar Rapids, Linn County Former Commissioner of Latino Affairs; grassroots immigration activist; member of the Latino Caucus Jorge Morales – West Des Moines, Polk County Statewide and regional activist; leader of Las Guitarras de MГѓВ©xico Miguel and Juanita Moreno – Glenwood, Mills County Miguel is a former president of AFSCME Local 3000; Juanita is a local activist Dr. Ernest and Rita Perea – Des Moines, Polk County Dr. Perea is a medical doctor of family practice and emergency medicine, CEO of EMP Medical Services PC, and Diplomate of the American Board of Family Practice; Rita is an Alianza board member Alfred Ramirez – Cedar Rapids, Linn County Former Executive Director of the White House Initiative on Educational Excellence for Hispanic Americans; Founder of Diversity Focus Anita Valenzuela (Garcia) – Muscatine, Muscatine County Auditor and local activist Rita Vargas – Davenport, Scott County First Latina ever elected to County office in Iowa; Scott County Recorder; LULAC National Woman of the Year (2001) Evelyn Acosta-Weirich – Iowa City, Johnson County Educational Advisor, University of Iowa Ana F. Ybarra-Rojas – Iowa City, Johnson County Career development coordinator Francine M. Ybarra-Rojas – Madrid, Boone County Family therapist ", "title": "Press Release - Iowans for Hillary Announces Hispanic Leadership Council"}
