{"date": "2007-11-27", "text": "Will Double Research Funding & Support Evidence-Based Prevention Programs The Clinton campaign unveiled its plan to fight the HIV/AIDS epidemic in the U.S. and around the world. The comprehensive approach addresses the multiple challenges that HIV/AIDS has presented for over 25 years and includes investments for increased research, prevention and education, and access to treatment and other services. Hillary's plan would especially help groups in the U.S. that have seen HIV infection rates rise over the past several years, including African Americans and gay men, and address the continued risk in Latino communities and among women. In addition, Clinton has pledged to increase funding for the global HIV/AIDS fight to at least $50 billion by 2013. \"In many ways, our fight against HIV/AIDS is at a crossroads. While we have made progress in education and developing medicine that keeps those living with HIV/AIDS healthier, we need to be vigilant in ensuring that people are getting the information and care they need,\" said Clinton. \"I believe with leadership and smart investments we can significantly reduce the number of new infections, develop treatments that turn HIV/AIDS into a chronic but manageable condition, and expand toward an eventual vaccine.\" On the domestic front, Clinton proposes doubling the HIV/AIDS research budget within the National Institutes of Health (NIH) to $5.2 billion annually, including the U.S. contribution towards finding a vaccine. Clinton's American Health Choices Plan will ensure that all Americans living with HIV/AIDS have access to care. Hillary will end the Bush administration's abstinence-only prevention policy, and instead, fund evidence-based HIV/AIDS prevention programs including, but not limited to, abstinence education as part of a comprehensive prevention message. Hillary will address the disproportionate burden of HIV/AIDS among minority communities. African Americans account for almost 50% of new infections and Hillary will partner with stakeholders in the community to reverse this trend immediately. She is also concerned about the high rates of infection in the Latino community and will take action to improve prevention among Hispanics. Hillary will increase funding for the Minority AIDS Initiative and support the prevention and treatment efforts of minority-run community based organizations. Her plan also increases federal funding for substance abuse treatment, which often leads to high-risk behavior that can lead to infection. By taking steps to crack down on substance abuse and help users seek treatment, the chance that people will contract HIV can be greatly reduced. Hillary is taking a bold stand to fight HIV/AIDS globally as well. She has committed to providing at least $50 billion over five years to combat HIV/AIDS around the world. This commitment will establish the U.S. as a leader in galvanizing the global community around meeting the Millennium Development Goal of halting and beginning to reverse the spread of HIV and other diseases by 2015. She will lead the world in achieving universal access to treatment by doubling the number of people that the U.S. supports with treatment. The Clinton plan will increase the number of health workers in training or in place in Africa by at least one million over a decade and ensure access to medications for all. HILLARY CLINTON'S PLAN TO FIGHT HIV/AIDS IN THE U.S. AND AROUND THE WORLD Today, Hillary Clinton unveiled her plan to combat HIV/AIDS globally through U.S. leadership and effective investments in research, prevention, and treatment. There are 33 million people living with HIV/AIDS around the world. Every day, about 6,800 people become newly infected and 5,700 die because of AIDS. Here in the U.S., while we have made tremendous strides in combating HIV/AIDS, about 40,000 people are newly diagnosed with HIV each year - an estimate which is expected to increase. More than 16,000 Americans die from AIDS annually and AIDS is the leading cause of death among African-American women aged 25-34. AIDS has had a devastating impact on the continent of Africa, where more than two-thirds of all people with HIV/AIDS live, more than three-quarters of AIDS-related deaths occur and where the epidemic has orphaned 11 million children. With a coordinated and comprehensive effort, Hillary knows we can significantly reduce the number of new infections annually and help provide coordinated care and treatment to the more than one million Americans currently living with HIV/AIDS in the U.S. and the millions living with HIV/AIDS around the world. As President, Hillary will:  Fight HIV/AIDS in the U.S. by:   Developing and Implementing a Comprehensive National AIDS Strategy; Guaranteeing Health Insurance for Individuals Living with HIV/AIDS;  Doubling the U.S. Contribution Towards Researching a Vaccine for HIV/AIDS and Increasing Commitments to Research; Ensuring Access to Care for All Americans Living with HIV; Increasing Funding for Evidence-Based HIV/AIDS Prevention; Addressing High Risk Behaviors that Often Lead to HIV/AIDS; Improving Opportunities for Substance Abuse Treatment; Providing Housing Opportunities and Supportive Services for People with AIDS; Increasing Funding for the Ryan White CARE Act; and Halting and Reversing the Burden of AIDS Among African-Americans and Latinos.  Fight HIV/AIDS Globally by:   Providing at Least $50 Billion for Global HIV/AIDS by 2013; Ensuring Universal Access to Treatment and Care; Committing to Access to Medications for All; Expanding Prevention Efforts and Targeted Outreach; Championing Universal Basic Education as a \"Social Vaccine\" to Combat HIV/AIDS; Increasing Flexibility and Improving Accountability in Use of HIV/AIDS Funds; Addressing the Disproportionate Impact of HIV Among Women; and Helping Children Gain Access to Treatment and Care.   This plan builds on Hillary's long history of working to address the HIV/AIDS epidemic. As Senator, Hillary has introduced legislation to expand access to treatment for low-income individuals living with HIV; pushed to make scientific, evidence-based prevention programs more available to youth; sought to increase coordination in combating global AIDS; championed legislation to provide universal basic education that would help prevent the spread of AIDS, and consistently supported increased funding for federal efforts against the epidemic both in the U.S. and around the world.  HILLARY CLINTON'S PLAN TO FIGHT HIV/AIDS IN THE U.S. As President, Hillary Clinton will continue her commitment to providing care and support for people living with HIV, as well as stopping the spread of the virus by: Developing and Implementing a Comprehensive National AIDS Strategy", "title": "Press Release - Clinton Announces Plan to Fight HIV/AIDS At Home And Abroad"}
