{"date": "2007-11-20", "text": "Would Strengthen Safety Net For Imported Food, Toys and Medicine Today in Shenandoah, IA, Hillary Clinton outlined her agenda to address the challenge of import safety for food, children's products, and drugs and medical devices. She believes that it is simply unacceptable that in America in 2007, families worry about the safety of the food they put on their dinner tables or the medicines they buy, or that any parents fear for their child's well-being every time they buy a toy. As President, Hillary will repair our import safety net by holding foreign producers to American safety standards, making importers responsible for the food, drugs, and toys they bring into our country, expanding the number of inspectors, and stiffening penalties for violators. \"Parents shouldn't have to worry about the safety of the food they serve for Thanksgiving or the toys they buy their children for Christmas. Protecting the public is one of the most basic jobs of our government, but the Bush Administration's response to the rash of toy recalls and contaminated food scares has been slow and inadequate,\" Clinton said. \"As President, I will make a fundamental commitment to protecting the health and safety of the American people and repair our broken consumer safety net.\" Hillary will implement a broad import safety agenda, including:  Creating a single food safety agency responsible for overseeing all federal food safety activities. Banning lead in children's products. Requiring independent third-party testing for imported toys. Holding foreign producers of drugs, toys, and food to American safety requirements, and holding importers liable for the products they bring into this country. Imposing stiffer civil penalties and pursuing criminal prosecutions against companies that put our children and citizens at risk. Increasing the number of inspectors at ports of entry and in foreign countries to verify that our safety rules are being followed. Mandating and fully funding Country of Origin Labeling. Appointing a Chair of the Consumer Product Safety Commission whose first priority is protecting the public - not industry.  ### HILLARY CLINTON'S IMPORT SAFETY AGENDA THE CHALLENGES", "title": "Press Release - Clinton Proposes New Safety Measures To Ensure Imported Products Are Safe For American Families"}
