{"date": "2008-01-30", "text": "With American families falling further into debt than ever before, Hillary Clinton unveiled a comprehensive plan to ensure fair access to credit on reasonable terms and to help Americans get back on their feet. Today, families across America are struggling to cope with spiraling household debt. Households in poverty face a vicious credit cycle, suffering abusive rates and penalties as they struggle with mounting debt. And middle-class Americans dealing with resetting mortgages and rising health care, college, and energy costs are depending more and more on credit cards just to stay afloat:   Americans have a record $940 billion in revolving debt, and the average person carries up to nine different credit cards. [Federal Reserve, 2007]  The average family carries thousands in credit debt; over 10% of credit card users carry a balance of $10,000 or more. [Fair Isaac, 2007]  Credit cardholders in the bottom two income quintiles - already paying on average the highest starting interest rates - are more than twice as likely to pay penalty interest rates as those in the top two income quintiles. Cracking down on predatory credit card companies is an important step in lifting American families out of poverty. [Demos, 2007]   For three decades now, credit card companies and major banks have been subject to less and less regulation. Most state regulations today do not apply to credit card companies, and federal law sets few restrictions on what they can do. To help reverse these trends and protect American families, Hillary's Fair Credit for Families Agenda will:   Immediately impose a 30 percent cap on annual interest rates for credit cards and work toward a lower cap.  Prevent credit card companies from unfairly increasing interest rates, or charging interest in unfair or unreasonable ways.  Require that credit card companies provide clear, easy-to-understand information about credit card terms and fees.  Create a new Financial Product Safety Commission to police credit products.  Crack down on abusive payday lenders and refund anticipation loan providers.  Empower communities to help families control their own financial destiny through improved financial literacy and better borrowing opportunities. ", "title": "Press Release - Hillary Clinton's Fair Credit For Families Agenda: A Comprehensive Plan To Address Credit Card Abuses, Promote Fair Lending, And Expand Access To Fair Credit"}
