{"date": "2007-11-27", "text": "Today in Bennettsville, South Carolina, Hillary Clinton outlined her plan to cut the dropout rate among minority students in half and help a new generation of Americans pursue their dreams. Clinton would invest more than $1 billion in programs that identify and support at-risk youth, provide early intervention, fund small schools with intensive personalized instruction, and recruit and train excellent teachers and principals in hard-to-serve areas. She would also establish high quality, universal pre-kindergarten to make sure all children are prepared to learn from an early age. \"We know that the education system is not working when close to half of African American and Hispanic students will not receive high school diplomas with their class. Disparities in our education system mean poor and minority children receive an education that is often separate and rarely equal. And the consequences are devastating,\" Clinton said. \"I am setting a big goal for this country: to cut the dropout rate for students of color in half within a decade. I'll address the crisis of untapped potential. I believe we can do it. I reject the fatalism which says we cannot reform our education system. I reject the notion that children dropping out of school are a lost cause - because when I'm president, these children will be my cause.\" When students don't complete high school, there are negative and long-lasting consequences for them and for society. On virtually all measures, high school dropouts struggle. They earn $35,000 less per year than college graduates - a wage gap that translates into $1 million over the course of a lifetime. They are three times more likely than college graduates to be unemployed and twice as likely as high school graduates to slip into poverty. As President, Hillary will provide more than $1 billion for intensive, targeted interventions to help minority students attain a high school diploma. Under her plan, Hillary will invest in:   Promising Approaches for Reducing the Dropout Rate; Recruiting and Retaining Excellent Teachers and Principals in Low-Income, Hard-to-Serve Areas; Identifying At-Risk Youth Early On and Providing Intensive Interventions to Get Them Back on Track; and Early Childhood Programs to Prepare All Children for School.  ### The Crisis of Untapped Potential: Hillary's Plan to Cut Dropout Rates ", "title": "Press Release - Addressing the Crisis of Untapped Potential"}
