{"date": "2008-04-29", "text": "Hillary Clinton today unveiled her plan to address soaring prices at the pump for Montanans. Liz Marchi, former President of Montana West Economic Development and former CEO of the Flathead County Economic Development Authority, had this to say about Hillary's plan: \"Montana, like many other states who have economies that depend on tourism, are already feeling the effects of high gas prices. With our relatively remote location from suppliers, gas prices are affecting the costs of goods shipped into our region for businesses and for consumers. Montana is very dependent on agriculture and the cost of farming inputs is increasing significantly because of rising energy costs. The price of gas is hurting the people and businesses of our state.\" [Click here] to listen. Full plan follows below: Americans are being squeezed at the pump like never before. The price of oil is approaching $120 a barrel. Gas is at a record high in Montana of $3.52, up from $3.20 a month ago and $2.93 a year ago, a 20 percent increase in just one year. Record oil prices are contributing to higher energy prices, food prices and a squeeze that is making many middle class families feel like they are falling further behind. American families are hurting now. They need a President who will focus every day on ensuring that they can make ends meet. That is why today, Hillary is unveiling her aggressive plan to address the problem of skyrocketing gas prices. Hillary's plan includes: Imposing a windfall profits tax on oil companies and using the money to suspend the gas tax for the peak summer months; Closing $7.5 billion in oil and gas loopholes and using the funds to provide assistance for lower-income families to pay their energy and grocery bills; Cracking down on speculation by energy traders and market manipulation in oil and gas markets that are driving up the price of oil by at least $20 a barrel; Pressuring OPEC to increase oil production, including by filing a WTO complaint against OPEC countries Stopping new additions to the Strategic Petroleum Reserve and standing ready to release oil to counter market spikes and reduce volatility.  This plan builds on Hillary's long-term plan to reduce our dependence on foreign oil and address global warming. She has committed moving America towards energy independence by cutting foreign oil imports by two-thirds from 2030 projected levels, more than 10 million barrels per day. Details of Hillary's Plan", "title": "Press Release - Hillary Clinton's Plan to Address Soaring Prices at the Pump for Montanans"}
