{"date": "2008-05-17", "text": "Today, at a rally in Frankfort, Kentucky, Hillary Clinton will outline her plan to create good jobs for Kentucky workers and cut taxes for middle class families. Hillary will also criticize Senator McCain for embracing George Bush's economic vision. She said: \"Senator McCain has said he doesn't understand the economy. But the economic agenda he's laying out on the campaign trail suggests he understands exactly what he's doing. It's nothing but four more years of George Bush economics: Corporate special interests first, middle class families last, borrow from China and stick our children and grandchildren with the bill.\" Hillary has a fundamentally different approach to the economy. Her economic plan will take back the benefits from corporate special interests and make the economy work for middle class families again. Her plan will: Provide new tax cuts for middle class families, not tax giveaways to corporations: While Senator McCain wants to offer corporations a $100 billion tax cut, Senator Clinton's plan will provide more than $100 billion in middle class tax cuts to help families afford healthcare, college, and saving for retirement. End tax cuts for companies that ship jobs overseas, and investing in an aggressive plan help create good jobs in the U.S.: While Senator McCain wants to maintain tax incentives for companies that outsource, Senator Clinton's plan will reform our tax code to reward job creation here in the U.S., and invest in helping create millions of good new jobs that can't be outsourced. Protecting Social Security from the McCain-Bush Privatization Plan: While John McCain has embraced President Bush's failed Social Security Privatization scheme, Senator Clinton's plan will protect Social Security for future generations of workers. Restoring fiscal responsibility to Washington: While Senator McCain wants to continue President Bush's fiscal recklessness with more than $400 billion in new unpaid for tax cuts, Senator Clinton's plan will restore fiscal discipline and move us back toward balanced budgets. Details of Hillary Clinton's Economic Plan for Kentucky Families", "title": "Press Release - Hillary Clinton Outlines Economic Plan for Kentucky; Criticizes Senator McCain for Embracing George Bush's Economic Vision"}
