{"date": "2007-09-19", "text": "Hillary's American Health Choices Plan will cover 496,000 uninsured Nevadans; Save Average Families $2,200 a Year At a news conference today, Nevadans for Hillary released a report that documents how Hillary Clinton's American Health Choices Plan would affect Nevada. \"Families across Nevada - and the rest of the country - are suffering under the burdens of a health care system where they cannot afford insurance,\" said Senator Clinton. \"Even if they can afford it, insurance companies routinely withhold payment for necessary treatments and health care. My plan puts consumers in the driver's seat.\" Under Senator Clinton's plan, the 496,000 Nevada residents who have no health insurance - including 101,000 children - will finally receive quality, affordable health care. Nevada has seen a 51 percent increase in the number of uninsured since President Bush took office. [Census 2007]. Senator Clinton's plan will help reverse this trend by providing new refundable tax credits to help cover the cost of high-quality health coverage for all Nevada residents. Those credits will guarantee that securing quality health care never becomes a crushing burden for Nevada families, by guaranteeing that premiums never rise above a certain percentage of family income. All Nevada residents will benefit from lower costs and improved quality under Senator Clinton's plan. Like families across the country, Nevada residents have been squeezed by skyrocketing health costs - family premiums are up 58% since 2000. [HHS, 2006]. According to a recent estimate by the Business Roundtable, AARP and SEIU, Senator Clinton's plan to institute a paperless health information technology system could save $165 billion per year - or $2200 for a typical family. Under this plan, all Americans can keep their current insurance, choose a new private plan or take part in a public plan like Medicare. Insurance will be portable and safe from discrimination on the basis of chronic or pre-existing conditions. For more information about Hillary Clinton's health care plan, please visit www.hillaryclinton.com/healthcare. Nevada's Health Choices: Hillary Clinton's Plan to Ensure Affordable, Quality Healthcare for All Nevada Residents", "title": "Press Release - Clinton Campaign Announces \"Nevada Impact Report\" Of Hillary's New Health Care Plan"}
