{"date": "2008-02-23", "text": "Today, Hillary Clinton outlined her agenda to provide tangible benefits for Ohio families, too many of whom are struggling to stay afloat in an economy that is sliding towards recession. Hillary's plans will help Ohio's parents manage the responsibilities of caring for their children and caring for their aging parents, afford quality health care, and enable their children to attend college, which opens the door to more job opportunities. Since 2000, Ohio's median household income has decreased by 6.6%. Over the same period, health insurance premiums increased by 43% and the cost of college grew by almost 60%. The average gas price in Ohio is now $3, up from $1.50 in 2001. The average home heating costs have gone from $945 to $1,059 in the past year alone, an increase of 12%. Ohio's families are facing rising costs while they face lower wages. It's time for a president who will put Ohio's families first. As President, Hillary will: create jobs; lower health care costs; increase access to college; create new tax credits to offset the cost of caregiving and long-term care; enact paid leave for all workers; provide more affordable child care; provide guaranteed sick days; and establish American Retirement Accounts and tax benefits for retirement savings. Hillary's Family Agenda for Ohio:  Job Creation: Hillary has a comprehensive plan to create good jobs here in the United States, train and equip our workers for the 21st century, and revitalize America's manufacturing industry. She will dramatically strengthen NAFTA's labor and environmental provisions; change NAFTA's investment provisions that grant special rights to foreign companies; strengthen NAFTA's enforcement mechanisms; and review NAFTA regularly. She'll also call for a time-out on all new trade agreements until the US has developed a comprehensive, pro-worker, pro-American trade policy that is enforceable, and end tax breaks for shipping US jobs overseas. She is the only candidate in the race who has proposed making immediate investments to jumpstart green collar job growth, including a program to train green collar workers, weatherize homes, and retrofit public buildings. She'll also invest in restoring a strong, vibrant manufacturing sector in America and provide $10 billion in funding to help states review and repair their critical infrastructure.", "title": "Press Release - Hillary Clinton: Addressing the Needs of Families In Today's Economy"}
