{"date": "2015-12-11", "text": "A new low.?On September 13, 2001, Alex Sanchez showed up for work at Ground Zero.?Just two days earlier, he had watched two airplanes crash into the World Trade Center in lower Manhattan. \"I didn't know whether to go left or right,\" he says. \"That's how I define terror—when you don't even know whether to go left or right.\"Alex was among the thousands of workers who worked around the clock to clean up Ground Zero. Working to clean up the ventilation system in a neighboring skyscraper, he was in a confined space and exposed to the an overwhelming amount of what he calls \"World Trade dust.\"?He considered it an honor to help his country and his nation, and he spent six months at Ground Zero, working 12 to 14-hour shifts. But months later, Alex started feeling sick.Eventually he couldn't go back to work.?A few years later, he saw a public service announcement asking Ground Zero clean-up crews to go to Mount Sinai Hospital for tests. When he showed up, he recognized fellow workers—and he knew deep down what had made him sick.?Like many of his fellow responders, Alex was never given the necessary training or the proper gear to protect them from exposure to toxins. And—to add insult to injury—politicians in Washington were complicating efforts to ensure 9/11 responders had access to the medical care and aid they needed.?He remembers one senator was different.?\"I had the opportunity to meet [Hillary] in the Senate, and she thanked us for our service,\" Alex says. Hillary sponsored the first version of the Zadroga Act, which provides health care for workers like Alex who breathed in toxic fumes at Ground Zero. And she has fought tirelessly to make sure that 9/11 responders could have the medical care they deserve.  Hillary at Ground Zero. But that law has expired—even though it has enough votes in both the House and the Senate.It's being blocked by Senate Majority Leader Mitch McConnell, who refuses to bring a bill permanently renewing the Zadroga Act to the floor for a vote.?For Alex, the stakes could not be more personal. Many of his co-workers and fellow advocates have serious illness—and some have died.? The fact that these courageous men and women are still waiting for Republicans in Washington to permanently recognize their sacrifice is unjustifiable. ?Hillary agrees.? Tell @SenateMajLdr to bring a vote on the #ZadrogaAct for 9/11 responders. Their sacrifice deserves our commitment to their health. -H— Hillary Clinton (@HillaryClinton) December 10, 2015 It's time for politicians to repay the sacrifice Alex and his fellow workers made in the aftermath of September 11. It's time for Republicans to stop playing politics with their health and well-being. It's time to make the Zadroga Act permanent.?  Alex Sanchez in front of the Freedom Tower.", "title": "Press Release - Meet a 9/11 Responder Whose Health Benefits Are Being Threatened By Republicans"}
