{"date": "2007-11-07", "text": "Home Improvement Expert Bob Vila Joins Hillary In NH To Discuss Ways Consumers Can Green Homes Hillary Clinton will call on Americans to take action to stop global warming and outline steps they can take to move the U.S. toward energy independence today, at a New Hampshire discussion with home improvement expert Bob Vila. At the core of Hillary's comprehensive energy plan is the principle of shared responsibility. That's why today she's launching a citizen pledge on her web site, www.hillaryclinton.com, to ask Americans to take concrete steps to help meet the twin challenges of global warming and dependence on foreign oil. \"My plan to meet these challenges is based on the old fashioned idea of shared responsibility. It will take leadership – but also citizenship. It will take a movement for change from the ground up,\" Clinton said. \"We can empower individuals with new tools and technology to lead the green revolution one home, one car and one business at a time. These choices determine the energy we use, the carbon we emit, and the world we leave for our children. I believe, when called upon, Americans will choose a clean energy future. This generation can become the Greenest Generation. We only need to light a spark – and that's what I'll do as president.\" Clinton and Vila will discuss ways to make America's homes more energy efficient by taking simple steps such as using compact fluorescent light bulbs and wrapping water heaters in a blanket to dramatically reduce energy usage across the country. Hillary will also outline her plans to issue Energy Independence Bonds—like U.S. Savings Bonds—to fund clean and renewable energy projects, and to modernize the nation's electricity grid so that unused power can be resold by consumers who conserve energy. Hillary's plan to empower Americans with tools to address global warming and move us toward energy independence, includes:  Asking Every American to Take a Pledge to Reduce Global Warming and Decrease our Dependence on Foreign Oil Issuing new \"Energy Independence Bonds\" Giving Individuals New Tools to Assess their Communities Fight Against Global Warming Helping Homeowners Improve the Energy Efficiency of Their Houses Calling on Colleges and K-12 Schools to Reduce Emissions on Campus and in Their Communities Supporting Healthy, High Performance Schools Create a \"Climate Star\" Program and National Clearinghouse to Help Consumers Evaluate the Global Warming Impacts of Products They Buy Using 21st Century \"Smart Grid\" Technology to Empower Consumers to Become More Energy Efficient Setting \"Net Metering\" Standards and Provide Tax Incentives to Helping Families and Small Business Generate Their Own Renewable Power    ###   Powering our Future: Hillary Clinton's Plan to Provide Individuals and Communities with Tools to Address Global Warming and Energy Independence ", "title": "Press Release - Clinton Calls On Americans To Take Action To Solve Climate And Energy Crisis, Provides Tools To Help Them \"Go Green\""}
