{"date": "2007-12-05", "text": "Addresses growing economic challenges that are hurting middle class Americans Today in New York City, Hillary Clinton challenged Wall Street to help end the foreclosure crisis that it helped to create, and vowed to introduce legislation if they fail to act. She also called for fast-acting, short-term stimulus measures to help hardworking families during this time of economic uncertainty. Clinton would implement a three-step plan to tackle the foreclosure crisis, including: at least a 90-day moratorium on foreclosures; a freeze on the fluctuating rates on subprime loans for at least 5 years until they can be converted into fixed rate, affordable loans; restoring accountability by requiring that lenders provide status reports on the number of subprime mortgages moved from adjustable to fixed rate. \"I'm here today to call on Wall Street to do its part to help end the foreclosure crisis that is devastating middle class families and threatening our economy,\" Clinton said. \"Wall Street needs to be part of a comprehensive solution that brings to the table all those responsible and calls on them to do their part. Wall Street helped create the foreclosure crisis, and Wall Street needs to help solve it. \"I believe we need a new beginning in our economic policy - one that strengthens our middle class and ensures that prosperity is widely shared, and that is based on an ethic of shared responsibility. A new beginning that makes Wall Street shoulder its responsibility for this crisis, and that gives homeowners the breathing room they need. One that makes the most well-off pay their fair share and gives the middle class the help it needs for education, for health care, and for retirement.\" More than 1.8 million foreclosure notices have been sent out this year, an increase of 74% from last year. And with the monthly payments set to rise on more than 1 million subprime loans next year, the situation is likely to worsen unless something is done. Experts now say that the foreclosure crisis is weakening the economic outlook, hurting industries from construction to autos, and making banks reluctant to lend companies the capital they need to expand and create jobs. Cities face the prospect of vacant properties marring neighborhoods, cutting tax receipts, and dragging down property values. With the decline in property values, home equity is also falling, and in the process families are losing a major source of wealth (home equity makes up 60% of the wealth of the middle class) and disposable income (in 2005, home equity withdrawals were 8% of families' disposable income). To help families cope with growing economic challenges, Clinton would provide a package of middle class tax cuts, including generous new support to make college, health care and retirement more affordable. She would also implement fast-acting, short-term stimulus measures, including a Community Support Fund of up to $5 billion to help hard-hit communities and distressed homeowners endure the foreclosure crisis, and a $2 billion emergency investment in energy assistance for families in cold weather states. Hillary's three-step plan to address the foreclosure crisis includes:", "title": "Press Release - Hillary Clinton Calls on Wall Street to Shoulder Responsibility for the Foreclosure Crisis"}
