{"date": "2007-11-08", "text": "The Clinton Campaign announced today the launch of the National Council of Civic Leaders, a network of over 75 women from more than 24 states that will help lead the campaign's efforts across the country. \"We are especially pleased to launch the National Council of Civic Leaders to bring together prominent women from all areas of civic responsibility in support of Hillary Clinton,\" Council Chair Susan Stern said. \"We have gathered a dynamic and diverse group of women leaders who share the same passion about bringing change to this great country of ours with Hillary Clinton leading the way. We are ready to make history and make Hillary Clinton the next President of the United States.\" \"Senator Hillary Clinton deeply believes in the power and importance of civil society and has been one of our country's greatest civic leaders for more than three decades,\" former First Lady of Iowa Christie Vilsack said. \"The work of our Council will be a powerful expression of first-hand experiences about the kinds of policies and leadership we need and the kind of policies and leadership that Hillary Clinton will provide as our next President.\" The Council is a network of women who are, or have been, leaders of non-profit, community and civic organizations. The members are uniquely qualified to speak about Hillary's long and abiding commitment to civic engagement. \"Senator Clinton and I share the same passion of building strong and active communities across the country,\" said human right activist Dolores Huerta. \"By building strong communities in America, we can and will improve the lives of people around the world.\" \"While most graduates of law school strive for partnership in a prestigious law firm, Hillary Clinton went straight to work for the Children's Defense Fund,\" Michelle Battle said. \"Hillary has spent her lifetime as an advocate for parents and children, and her dedication to civil society serves as an inspiration to us all. She truly understands the responsibility we have, as American citizens, to continuously strengthen society for our children.\" The Council is a way to extend the Senator's presence around the country and to engage people in the campaign. \"I'm honored to have the support of this distinguished group of women from across the country,\" Clinton said. \"These community leaders have devoted their lives to strengthening civil society.\" The founding members of Hillary's National Council of Civic Leaders are: ", "title": "Press Release - Clinton Campaign Launches National Council of Civic Leaders"}
