{"date": "2008-02-07", "text": "The Clinton campaign announced today the release of two radio ads featuring former Louisiana Senator John Breaux. The 60 second spots, entitled \"Stand For Us\" and \"Get it Done\" come one day before Louisiana voters head to the polls. Hillary has made Gulf Coast recovery a priority in her campaign. She has a clear plan and vows to cut through the red tape to deliver necessary federal assistance and improve federal disaster response. Her plan also proposes the development of a Gulf Coast Corps to attract skilled professionals to the region and employ local workers to rebuild infrastructure and restore public services. Her leadership in the Senate brought 107,000 Louisianan children health care under the State Children's Health Insurance Program that she helped develop. Hillary understands all of the concerns of Louisiana voters and will deliver for them in the White House. To listen to \"Stand By Us\", [Click here]. To listen to \"Get it Done\", [Click here]. Following are the scripts for the ads: \"Stand By Us\"  Radio: 60 Senator Breaux: This is Senator John Breaux. Louisiana needs a president who hears our voices and can solve our urgent problems. That's why I'm supporting Hillary Clinton. When Katrina and Rita struck, she was there for us, right from the start. Hillary was one of the first people in the country to call for FEMA to be a separate agency, run by a professional, not by the head of a horse association. Hillary understands that when a national disaster strikes our government cannot play politics. And Hillary has been there for Louisiana every step of the way, voting to fund our costal restoration, pushing to get people back in their homes, and fighting to stop giving bonuses to contractors who aren't doing their jobs. Most important, Hillary has made a commitment that as president she will appoint one person, reporting directly to her to be in charge of the reconstruction of the Gulf Coast. She knows we need to return competence to government. Speeches are nice but results are what really matter. This is John Breaux asking you to join me in voting for Hillary on Saturday. VO: Paid for by Hillary Clinton for President. Hillary Clinton:", "title": "Press Release - Two New Ads Featuring Louisiana Senator John Breaux Highlight Hillary's Gulf Coast Recovery Agenda"}
