{"date": "2008-04-14", "text": "Hillary Clinton attended a forum hosted by the Alliance for American Manufacturing and unveiled a new set of proposals to strengthen trade enforcement and crack down on China's unfair trade policies. At the \"Forum on Manufacturing\" in Pittsburgh, Hillary criticized the Bush administration for failing American workers by not aggressively enforcing trade laws and articulated how she would ensure that trade laws are followed. \"We need solutions to fix our trade laws, build a strong manufacturing base, and stand up to China and say that unsafe toys and unfair currency practices are unacceptable,\" said Clinton. \"I know what manufacturing means for this country. It means good jobs, thriving communities and the products that keep this country going and growing every single day. Our manufacturers and manufacturing workers have shaped our past – and you will drive our future. And if you give me the chance, I will stand strong for you every single day as President.\" As President, Hillary announced that she would provide relief for U.S. industries that have been hurt by excessive Chinese imports; aggressively use the World Trade Organization (WTO) to challenge other countries for violating trade rules; create a new Intellectual Property Enforcement Network to crack down on piracy issues; accept and reviewing petitions when outside groups petition the government to enforce trade laws; and ensure that we can take retaliatory action against China and other non-market economies when they subsidize their domestic industries. President Bush has failed to effectively enforce our trade laws. For seven years, the Bush Administration has ignored or under-utilized legitimate trade enforcement tools as countries like China have violated trade rules and hurt U.S. manufacturers. The Bush Administration has brought less than half as many cases to the WTO as our trading partners have brought against the US. It has also dragged its feet in addressing China's currency manipulation and actively worked against efforts to provide legitimate relief to threatened U.S. industries. During this period, the trade deficit has nearly doubled to $708 billion and China's holdings of U.S. public debt has risen to almost $500 billion – over 10 percent of total public holdings. President Bush has allowed China to become America's banker, making it harder to promote our interests and push back against their unfair trade practices. Senator Clinton understands that lax enforcement has contributed to a trade policy that is not working for American workers or the American economy. She has already outlined an ambitious trade agenda, including a trade time-out to review existing trade agreements and to formulate a new pro-worker trade policy; a detailed four-part plan to fix NAFTA; and appointing a new Trade Prosecutor and doubling the trade enforcement budget at USTR. The plan she outlined today will ensure that, as we modernize and improve trade agreements and trade laws, those laws are effectively and aggressively enforced, and ensure that America's trading partners play by the rules. Her plan includes: I. Better Utilizing and Strengthening Our Trade Enforcement Tools  Aggressively Challenge Trading Practices that Violate World Trade Organization (WTO) Agreements through the WTO Dispute Settlement Mechanism.   Ensure that \"Section 301\" Petitions Alleging Unfair Trading Practices Receive a Fair, Nonpartisan Review.  Create a New Intellectual Property Enforcement Network to Strengthen Protections for U.S. Intellectual Property.  II. Cracking Down On China's Unfair Trade Practices  Take a Tough Line on Chinese Currency Manipulation. Provide \"Section 421\" Relief for U.S. Industries Hurt by Surges of Chinese Imports.  Apply Countervailing Duties to Non-Market Economies Like China. I. BETTER UTILIZING AND STRENGTHENING OUR TRADE ENFORCEMENT TOOLS:  For too long, American workers have had a President who does not believe in enforcing our trade laws. Hillary will reverse that trend by actively using our trade enforcement tools to promote U.S. interests and by strengthening those tools to ensure that our trading partners play by the rules. 1. Aggressively challenge illegal trading practices through the World Trade Organization (WTO) Dispute Settlement Mechanism. The Bush Administration has filed less than 3 cases a year at the WTO to challenge our trading partners for breaking WTO rules. That compares to an average of 11 cases filed per year during the Clinton Administration.[1][2] President Bush waited almost seven years before challenging some of China's most obvious trade violations, including on illegal subsidies and intellectual property rights.[1][2] Meanwhile, our trading partners have been actively pursuing claims against the U.S. at the WTO, filing an average of seven cases per year since 2001. This puts the U.S. on its heels, and puts U.S. workers and businesses at a competitive disadvantage.  As President, Senator Clinton will fully utilize the WTO Dispute Settlement Mechanism to challenge practices that violate WTO commitments. For example, according to the National Trade Estimate, China continues to employ discriminatory regulations, subsidies, and import and export restrictions that may violate WTO rules, but which the U.S. is not adequately pursuing at the WTO.[1][3] In addition, Hillary will work toward establishing WTO rules and policies that respect and strengthen workers' human rights and protect the environment. And she will work to speed up the decision making process at the WTO. Right now, the lengthy deliberation process means our industries continue to incur major losses during the time it takes to resolve a complaint.[1][4] 2. Ensure that \"Section 301\" Petitions Alleging Unfair Trading Practices Receive a Fair, Nonpartisan Review. Another important tool in our trade enforcement toolkit is the provision that allows non-governmental actors to petition the government about unfair trading practices by our trading partners. The Bush Administration has failed to utilize this tool. Since President Bush took office, the United States Trade Representative has not only refused to take action based on the five Section 301 petitions that have been filed – it has refused to even open an investigation to find out if our industries are being treated unfairly. The Administration rejected without adequate explanation a petition filed by the AFL-CIO detailing worker rights abuses in China, including the prohibition of independent union organizing, failure to enforce minimum wage and maximum hour regulations, and the use of child and forced labor.[1][5] And the Administration dismissed a petition from 20 industrial, labor, agricultural, and service organizations on China's currency manipulation only a few hours after it was submitted.[1][6]  As President, Senator Clinton will direct her USTR to investigate and publicly report on all Section 301 petitions that are filed, rather than dismissing them out of hand. She believes that Section 301 petitions deserve a fair, nonpartisan review, and should be followed up with appropriate action through our trade laws or at the WTO based on the outcome of the inquiry. She will ensure that this trade enforcement tool is used to help American workers and industries, not left by the wayside.  3. Create an Intellectual Property Enforcement Network to stop IPR violations. Studies have found that counterfeiting is an enormous business in China, costing the global intellectual property industry over $450 billion.[1][7] In the US, over 81 percent of border seizures of products that violate IPR laws come from China.[1][8] The US auto industry alone loses over $12 billion a year – at a cost equivalent to hiring 250,000 additional American workers – from counterfeits, 75 percent for which China is responsible.[1][9] Senator Clinton understands that this is not a problem that can be fixed overnight. But she recognizes the importance of having a President that is willing to deploy diplomatic, legal and enforcement efforts to help reduce incidences of China's intellectual property rights abuses.  As President, Senator Clinton will create a new Intellectual Property Enforcement Network to develop and implement a comprehensive national effort to strengthen IPR protections. The IPEN, an idea championed by Senator Bayh, would improve inter-agency coordination and create a new international task force to work with foreign governments on IPR enforcement. In addition, Hillary will increase the ITC's capacity to manage technologically complex IPR cases, including by allowing IPR experts to decide cases.  II. CRACKING DOWN ON CHINA'S UNFAIR TRADE PRACTICES:  With our trade deficit with China now at a record $256 billion, Hillary believes it is time for aggressive action to crack down on China's unfair trade practices. Hillary Clinton will not take a passive line on unfair trade practices and will work to level the playing field for American workers, reducing our trade deficit and keeping more jobs here at home. 1. Take a Tough Line on Currency Manipulation.", "title": "Press Release - Hillary Clinton Calls For Stepped Up Enforcement Of Trade Laws"}
