{"date": "2008-02-15", "text": "A Comprehensive Plan To Address Credit Card Abuses, Promote Fair Lending, And Expand Access To Fair Credit In Ohio and Across America With families in Ohio and across America falling further into debt than ever before, Hillary Clinton highlighted her comprehensive plan to ensure fair access to credit on reasonable terms and to help Americans get back on their feet. Today, hardworking families are struggling to cope with spiraling household debt. Middle-class Ohioans dealing with resetting mortgages and rising health care, college, and energy costs are depending on credit cards just to stay afloat: Ohio ranks sixth of all states with the most credit-card debt, with residents carrying a combined total of $33.1 billion worth of card debt in 2005. [Columbus Dispatch, 2007.] About 16 percent of Ohioans have 10 or more credit cards. [Columbus Dispatch, 2007.]  In a recent survey of credit card users, the average household credit card balance in Ohio was more than $9,000. [TrackCards, 2008.]  To make matters worse, recent news accounts reveal that credit card companies and banks are imposing sudden rate hikes and fee increases on many customers to cover their own losses in the mortgage market. Banks are also imposing heftier ATM and cash-advance fees, further squeezing American families. Meanwhile, the Federal Reserve's recent rate cuts were expected to make credit cheaper for American consumers. But even as the Federal Reserve cut rates sharply, the average variable rate on credit cards has dropped less than a point. Hillary believes that hardworking families that are struggling should not face the added burden of abusive credit card policies. Ending Credit Card Lending Abuses For three decades now, credit card companies and major banks have been subject to less and less regulation. Most state regulations today do not apply to credit card companies, and federal law sets few restrictions on what they can do. To help reverse these trends and protect American families, Hillary's Fair Credit for Families Agenda will:  Immediately impose a 30 percent cap on annual interest rates for credit cards and work toward a lower cap.   Prevent credit card companies from unfairly increasing interest rates, or charging interest or fees in unfair or unreasonable ways.   Require that credit card companies provide clear, easy-to-understand information about credit card terms and fees.   Create a new Financial Product Safety Commission to police credit products.  ", "title": "Press Release - Hillary Clinton's Fair Credit For Families Agenda"}
