{"date": "2007-10-04", "text": "Hillary Clinton's Agenda to Reclaim Scientific Innovation On the 50th anniversary of the launch of Sputnik, Hillary Clinton today vowed to end the Bush Administration's war on science and announced her agenda to promote scientific discovery in research, medicine and space exploration. \"For six and half years under this president, it's been open season on open inquiry. And by ignoring or manipulating science, the Bush administration is letting our economic competitors get an edge in the global economy,\" Clinton said. \"I believe we have to change course – and I know America is ready. What America achieved after Sputnik is a symbol of what America can do now as we confront a new global economy, new environmental challenges, and the promise of new discoveries in medicine. America led in the 20th century – and with new policies and a renewed commitment to scientific integrity and innovation, America is ready to lead in the 21st.\" Clinton said her administration would restore scientific integrity by supporting the independent work of government scientists, promoting innovation and medical research, and by returning to evidence-based decision-making. Hillary will restore the federal government's commitment to science by:  Rescinding the ban on ethical embryonic stem cell research Banning political appointees from unduly interfering with scientific conclusions and publications  Directing department and agency heads to safeguard against political pressure that threatens scientific integrity and to promote transparency in decision-making  Appointing an Assistant to the President for Science and Technology Policy and strengthening the White House Office of Science and Technology Policy  Reviving and enhancing the national assessment on climate change Enhancing American leadership in space through investments in exploration, earth sciences, and aeronautics research  Pursuing a comprehensive innovation agenda, including establishing a $50 billion Strategic Energy Fund   ### Hillary Clinton's Agenda to Reclaim Scientific Innovation", "title": "Press Release - Ending the War on Science"}
