{"date": "2016-03-06", "text": "Hard work pays off. Presidential campaigns have highs, lows, and everything in between. The past week was a good one for Hillary Clinton and everyone standing behind her in this election.It started with a huge win in South Carolina.We did it, South Carolina. pic.twitter.com/7qGDnavcID— Hillary Clinton (@HillaryClinton) February 28, 2016The next two days were a whirlwind as Hillary made stops in Tennessee ...... Arkansas ...... Massachusetts ...... and Virginia.Then came Super Tuesday, which lived up to its name.While one Republican candidate talked about \"making America great again,\" Hillary had a different message:(And that was before she pulled off an important win in Massachusetts!)M-A-S-S-A-C-H-U-S-E-T-T-S! #ShesWithUs pic.twitter.com/qvNseUqRAc— Hillary for America (@HFA) March 2, 2016The wins on Super Tuesday gave Hillary a commanding lead among pledged delegates.We're ahead by 199 pledged delegates. Here's why that matters: https://t.co/xOX1an4OYp pic.twitter.com/8oOvuzbsbB— Hillary Clinton (@HillaryClinton) March 6, 2016The next day, Hillary took to LinkedIn to discuss an issue on a lot of people's minds: student loan debt.Today on @LinkedIn: We need to solve America's student debt crisis. https://t.co/GyEmaYXOkF— Hillary Clinton (@HillaryClinton) February 29, 2016And she was welcomed back to New York with open arms.On Thursday, the Republican candidates took the stage for another debate.#GOPdebate pic.twitter.com/SGW200luN8— Hillary Clinton (@HillaryClinton) March 4, 2016The more time that passes, the scarier this gets. ?? #GOPdebate pic.twitter.com/EEfDR3qyM0— Hillary Clinton (@HillaryClinton) March 4, 2016Marriage equality is the law of the land. Deal with it. #GOPdebate pic.twitter.com/gPS1BVgipl— Hillary Clinton (@HillaryClinton) March 4, 2016How many more of these do we have to sit through? Asking for a friend. #GOPdebate pic.twitter.com/AxGFlerSRW— Hillary Clinton (@HillaryClinton) March 4, 2016Who won the #GOPDebate? @HillaryClinton #Duh #ImWithHer #HillYes pic.twitter.com/lIQBzHkR2B— Tyler James (@justcasualtyler) March 4, 2016Friday was all about jobs. Hillary gave a speech in Detroit with messages of optimism ...\"As Detroit proves every day, what has been broken can be re-built, stronger than before.\" —Hillary in Michigan— Hillary Clinton (@HillaryClinton) March 4, 2016... and accountability ...\"If you cheat your employees, exploit your customers, pollute our environment, or rip off taxpayers, we will hold you accountable.\" —Hillary— Hillary Clinton (@HillaryClinton) March 4, 2016... and, of course, she laid out detailed solutions..@CNN: Clinton lays out plan to help American workers https://t.co/UcrBycIS7k— The Briefing (@TheBriefing2016) March 6, 2016Voters in Louisiana made sure the week ended on a high note. Thank you, Louisiana! pic.twitter.com/7KPEuA2mWJ— Hillary Clinton (@HillaryClinton) March 6, 2016And Hillary kept talking about what we can accomplish—if we work together:Diversity is a strength, not a weakness. If we lift each other up, we can make this country even stronger.https://t.co/76EVKvQ759— Hillary Clinton (@HillaryClinton) March 6, 2016The best way to celebrate a great week? Keep working hard to earn every vote. As Hillary gets ready for the Democratic debate in Flint, Michigan, volunteers across the country are spending the day making phone calls and knocking on doors in their communities. There's still a long way to go, and it isn't going to be easy—but the hard work of Team Hillary is paying off.", "title": "Press Release - It Was a Big Week For Hillary Clinton (and the People Who Support Her)"}
