{"date": "2007-08-23", "text": "Today in Lebanon, New Hampshire, Hillary Clinton outlined her plan to improve the quality of health care for all Americans. As President, Hillary would fundamentally reform the nation's health care system by lowering costs, improving quality, and covering all Americans. Earlier in the campaign, she announced a multi-faceted plan to lower costs and increase value in the nation's health care system, which taken together would lower national health spending by at least $120 billion a year. Today, she announced several proposals that build on those initiatives to ensure high quality care by empowering health professionals, patients, and private and public payers to improve the financing and delivery of health care that every American receives. And next month, she will unveil her proposals to ensure universal coverage, so that every American will have quality, affordable health care. Hillary's agenda returns patients to the center of the health care system again by empowering and relying on the skill of those who provide care - physicians, nurses, other clinicians, and health care organizations - to improve that care continually. Background While health care in the U.S. has enormous strengths, many Americans worry about the quality of care they receive. In 2006, a survey conducted by the Kaiser Family Foundation and AHRQ found that 51 percent of Americans were dissatisfied with the quality of the American health care system. Per capita  health care spending in the U.S. is far greater than in any other industrialized country, yet other nations have better health outcomes, including longer life-expectancy, lower rates of obesity and related conditions such as heart disease and diabetes, fewer years of life lost due to failure to treat treatable conditions, and lower infant mortality. According to a RAND study, adults in the U.S. on average fail to receive about half the recommended care that modern clinical science says they need. In fact, the Institute of Medicine (IOM) in 1999 reported that between 44,000 and 98,000 people die each year in our nation's hospitals as a result of preventable injuries from medical care. In short, for the amount of money that we spend in health care, Americans should be getting better quality care. Improving the quality of our health care system can and will reduce costs. Hillary's Agenda: Reforming Health Care by Focusing on Quality A reformed high-quality healthcare system must include a strong evidence base so we know what treatments work best, a quality measurement infrastructure based on this evidence to assess the quality of care patients receive from their health care providers, the integration of those quality measures into the delivery of care through health information technology, reimbursement incentives and accountability, and a commitment to placing patients at the center of the system, through increased transparency and greater access to information. To achieve this, Hillary will: Empowering Providers: Empower Physicians to Improve Quality Through Physician-Driven Certification Programs: In our health care system today, there is tremendous variation in the cost and quality of care from state to state, and even from hospital to hospital in the same town. For example, in Wilkes-Barre, Pennsylvania spine surgery rates are 1.99 per 1,000 Medicare patients, while in Lancaster, they are 5.44 per 1,000. Physician specialty boards, such as the American Board of Internal Medicine, have established Maintenance of Certificate (MOC) programs to promote lifelong learning and help doctors stay up to date on the latest scientific advances and procedures. Doctors who scored higher on MOC examinations had better outcomes in treating patients with diabetes, and were more likely to ensure that their patients received mammograms. Heart attack patients treated by board certified doctors were 15% less likely to die than those treated by non-certified doctors. MOC programs help ensure that the right care is given to patients at the right time, improving quality, while reducing costs. Hillary's proposal would federally recognize these initiatives and create financial incentives for participating in them. ", "title": "Press Release - Hillary Clinton Announces Agenda to Improve the Quality of Health Care for All Americans"}
