{"date": "2008-04-01", "text": "Sen. Obama voted for the 2005 Energy Bill, written in secret by Vice President Cheney and the energy lobby. Thomas Friedman referred to the bill as \"the sum of all lobbies.\" U.S. PIRG noted that the bill's \"heavy tilt toward big oil companies reflects the influence of Exxon Mobil and other oil companies on policy-makers in Washington, DC.\" The Washington Post editorialized that the bill was a \"piГѓВ±ata of perks for energy industries.\" Indeed, the bill contained $6 billion in subsidies to the oil and gas industry and $12 billion to the nuclear power industry. Although Sen. Obama voted for the legislation, he has spoken as if he opposed it on the campaign trail, criticizing it repeatedly. At a presidential debate he said \"You can look at how Dick Cheney did his energy policy...he met with oil and gas companies forty times, and that's how they put together our energy policy.\" He's attributed the failure of our current energy policy to Congress's \"failure to stand up to the lobbyists.\" Sen. Obama's rhetoric blasting the policies of Vice President Dick Cheney and energy lobbyists can be stirring. But Obama's actions haven't matched his words. More info below: Public Citizen: Energy lobby gained 'exclusive, private access to lawmakers' to advocate for 2005 Energy Bill 'starting with vice-president Dick Cheney's energy task force': \"Since 2001, energy corporations have showered federal politicians with $115 million in campaign contributions—with three-quarters of that amount going to Republicans. This cash helped secure energy companies and their lobbyists exclusive, private access to lawmakers, starting with Vice-President Dick Cheney's Energy Task Force, whose report provided the foundation of the energy bill passed by Congress and signed by President Bush on August 8.\" [Public Citizen, \"The Best Energy Bill Corporations Could Buy,\" citizen.org] U.S. PIRG: 'The [2005] energy law's heavy tilt toward big oil companies reflects the influence of Exxon Mobil and other oil companies on policy-makers in Washington, DC': \"The new energy law's heavy tilt toward big oil companies reflects the influence of ExxonMobil and other oil companies on policy-makers in Washington, DC.\" [U.S. Public Interest Research Group, \"How Exxon Mobil and the Oil Industry Benefit from the 2005 Energy Bill,\" 8/2005] Thomas Friedman: 2005 Energy Bill Was 'The Sum of All Lobbies': \"This bill is what the energy expert Gal Luft calls 'the sum of all lobbies.' While it contains some useful provisions, it also contains massive pork slabs dished out to the vested interests who need them least -- like oil companies -- and has no overarching strategy to deal with the new world...The sum of all lobbies.\" [Thomas Friedman, New York Times, 8/5/05] Washington Post: 2005 Energy Bill was 'a piГѓВ±ata of perks for energy industries': The Washington Post said, \"...The energy bill, touted as a way to reduce dependence on foreign oil or moderate gasoline prices, has been turned into a piГѓВ±ata of perks for energy industries.\" [Washington Post, 7/30/05] Energy Bill gave $6 billion in subsidies to oil & gas industry: [Public Citizen, \"The Best Energy Bill Corporations Could Buy,\" citizen.org] Energy Bill gave $12 billion in subsidies to nuclear power industry: [Public Citizen, \"The Best Energy Bill Corporations Could Buy,\" citizen.org] Obama: 'You can look at how Dick Cheney did his energy policy...he met with oil and gas companies forty times, and that's how they put together our energy policy': \"The one thing I have to remind folks, though, of – we've been talking about this through Republican administrations and Democratic administrations for decades. And the reason it doesn't change – you can take a look at how Dick Cheney did his energy policy. He met with environmental groups one, he met with renewable energy folks once, and then he met with oil and gas companies forty times, and that's how they put together our energy policy. We've got to put the national interest ahead of the special interest, and that's what I'll do when I'm President of the United States.\" [Democratic Presidential Debate, 7/23/07] Obama: 'I'm in Washington. I see what's going on. I see those powers and principalities have snuck back in there, and they're writing the energy bills': \"Speaking early this month at a church in Selma, Ala., Sen. Barack Obama (D-Ill.) said: \"I'm in Washington. I see what's going on. I see those powers and principalities have snuck back in there, that they're writing the energy bills and the drug laws.\" It was a fine populist riff calculated to appeal to Democratic audiences as Obama seeks his party's presidential nomination. But not only did Obama vote for the Senate's big energy bill in 2005, he also put out a press release bragging about its provisions, and his Senate Web site carries a news article about the vote headlined, \"Senate energy bill contains goodies for Illinois.\" [The Politico, 3/26/07] Obama: Energy policy is the result of Congress's 'failure to stand up to the lobbyists': \"For many years now, the lobbyists and the special interests have been blocking progress on the issues that matter most to folks who live in rural areas,\" Obama said. \"Because of our failure to stand up to the lobbyists and develop a real energy policy, Exxon has been making record oil profits at a time when Elko has been paying record gas prices. Folks around here are now paying $3.16 a gallon – that's nearly 30 cents more than the national average. And that makes a big difference when you're driving 50 miles roundtrip to your job, like some folks around here are.\" [Obama Campaign Press Release, 8/6/07]", "title": "Press Release - Flashback: Obama Voted For Bush/Cheney Energy Bill, Written In Secret By Industry Lobbyists"}
