{"date": "2008-01-22", "text": "The Clinton campaign today reinforced its commitment to protect a woman's right to make the most fundamental decisions about her life and health and announced a comprehensive agenda for women's reducing unintended pregnancy and enhancing access to reproductive health care. The announcement comes on the 35th anniversary of the landmark Supreme Court decision Roe v. Wade and follows the news of the endorsement of WCLA - Choice Matters, one of the oldest pro-choice advocacy organizations in the nation. \"When I'm President, I will appoint judges to our courts who understand that Roe v. Wade isn't just binding legal precedent, it is the touchstone of our reproductive freedom, the embodiment of our most fundamental rights, and no one - no judge, no governor, no Senator, no President - has the right to take it away.\" The agenda includes preventing unintended pregnancies by increasing access to honest, accurate sex education, contraception and family planning services, ensuring that private health plans offer the same level of coverage for contraception as they do for other prescription drugs and services, ensuring that women who survive sexual assault have access to emergency contraception upon request. Clinton also calls for providing greater access to reproductive health care services overseas. \"On the 35th anniversary of Roe v. Wade, I am reaffirming my commitment to safe, legal, and rare abortion, and unveiling an agenda for decreasing the number of unintended pregnancies in the U.S. through honest and complete sex education and expanded access to contraception and family planning,\" said Clinton. WCLA joins other prominent pro-choice organizations endorsing Hillary Clinton for President, including the National Organization for Women PAC, EMILY's List, Women's Campaign Forum, National Women's Political Caucus, Women's Political Committee. Below is Hillary's full agenda for women's reproductive care: Hillary Clinton's Agenda for Women's Reproductive Health Care On the 35th anniversary of Roe v. Wade, Hillary is recommitting to Roe as the law of the land and charting a new course for women's reproductive health care based on preventing unintended pregnancy. Hillary envisions a world in which every child born is wanted, cherished, and loved. She believes in empowering people with honest and complete information so that they can make responsible decisions, and in providing broader access to contraception, family planning, and the full range of reproductive health care services for women of all income levels. Hillary has been a leading advocate for the right of every woman to make the most personal of life decisions for years. She believes the right to privacy is a fundamental right, and that abortion should be safe, legal, and rare. Her views on reproductive rights were informed by seeing what happens when the government gets involved in these decisions. As First Lady, Hillary traveled to Romania where, under a Soviet-style dictatorship, the government had controlled every aspect of women's reproductive health by eliminating birth control, sex education and abortion and requiring humiliating government-controlled monthly exams, in order to compel every woman to bear five children and build the Romanian state. Hillary saw the other extreme in China, with its one birth policy, under which women could be sterilized or forced to have an abortion if they got pregnant for a second time. Hillary took those lessons to heart. In the Senate, she has been an outspoken critic of the Bush Administration's relentless and insidious attempts to undermine Roe and has been on the forefront of the major victories on behalf of the pro-choice community in recent years. In the Senate, Hillary waged a three-year effort, along with Senator Patty Murray, to get the FDA to accept the overwhelming recommendation of the medical community and approve emergency contraception for over-the-counter sales. She also helped craft a winning strategy to put the right wing on the defensive by highlighting their opposition to contraception, a position that is way out of the mainstream in the U.S. Hillary championed the Prevention First Act, which expands access to contraception for women of all income levels, and provides for honest and complete sex education programs. As President, Hillary will be vigilant in ensuring that each woman maintains the right to plan her own family and protect her reproductive health. Maintaining Roe as the Law of the Land  Appointing Justices that will uphold the right to privacy - Senator Clinton opposed the nominations of Justices Alito and Roberts to the Supreme Court because she believed they represented the greatest threat to Roe since it was decided. Her prediction has been born out through Gonzales v. Carhart, the first time the Supreme Court upheld a law outlawing a specific abortion procedure. As President, Hillary will nominate justices who share her view that the Constitution protects a woman's right to make the most fundamental decisions about her life and health, and that the right to privacy is a fundamental right. Enacting the Freedom of Choice Act - Hillary will sign into law the Freedom of Choice Act, which would codify Roe v. Wade and send a renewed signal to the courts that the will of Congress and the President is to keep abortion legal. Preventing Unintended Pregnancies ", "title": "Press Release - On Anniversary Of Roe, Clinton Announces Agenda For Reproductive Health Care"}
