{"date": "2007-07-09", "text": "To: Interested Parties From: Mark Penn, Chief Strategist Date: July 9, 2007 Re: After 6 Months With two quarters of 2007 behind us and just 6 months to go until the Iowa caucuses it is a good time to see where Hillary stands and why. The bottom line? Hillary's electoral strength has grown in the last quarter and she is better positioned today than ever before to become the next President of the United States. Recent polls have her at or near 40% with leads of 15-20 points over her nearest competitors. Voters yearn for change and they say that Hillary has the strength and experience to actually bring about that change. Hillary's message: that her strength and experience will bring real change that America needs, is resonating strongly with voters. Despite unprecedented early publicity for all the candidates, Hillary's support in the last few months has strengthened nationally, in key states and in the general election. This improvement has occurred as voters have learned more about all of the candidates. In other words, as all the candidates' name ID's have increased, so has Hillary's lead. So far the debates have been the key moments where the voters get to see all the candidates side by side and they have shown just how ready Hillary is to be president and how she has the strength and experience to make change happen. She won the debates overwhelmingly and they are a key indicator of how this race will play out in the next 6 months and in the general election. There will be another debate every month from now until the end of the year, and each debate provides Hillary with another opportunity to demonstrate her experience, talk about her record on the issues, and show voters why she is the person best qualified to be president. In the latest Newsweek poll, which fielded after the 2nd quarter fundraising numbers were released, Hillary's lead in the Democratic primary nearly doubled from 12 points in May to 23 points now. Hillary's favorability has risen to 57% among all Americans, and they say overwhelmingly she has the experience to be a good president (70%). Nearly two-thirds say there is a good chance or some chance they will vote for her (62%). In the general election, Hillary leads top Republican Rudy Giuliani by seven points (51 percent to 44 percent) in the last Newsweek poll, up from just three points a month ago. The next closest Democrat leads Giuliani by only five points (49 percent to 44 percent), down from seven points in May. In fact, Hillary leads Giuliani in all the latest national polls -- CNN, Fox, Gallup, Newsweek, NBC/Wall Street Journal, Quinnipiac and Cook/RT Strategies. And Hillary is tied or ahead of Giuliani in key battleground states which Democrats lost in both 2000 and 2004, including Florida, Ohio and West Virginia. Democratic Primary As observers like Charlie Cook have pointed out, Hillary has the coalition of support (women, strong Democrats, lower, middle-income and working families, Hispanics and African-Americans) that has traditionally won Democratic primaries. The profile of voters supporting other contenders, according to Cook, resembles the \"support profiles of Gary Hart in 1984, Paul Tsongas in 1992 and Bill Bradley in 2000. The numbers are splashy and significant but not sufficiently broad-based to capture a nomination.\" Hillary's support is highest among key voter groups who make up the core of the Democratic coalition: women, Hispanics, African-Americans, strong Democrats and lower, middle-income and working families. Her lead in the Democratic primary widens to 29 points among non-whites. The latest Gallup and CBS polls confirm the extraordinary enthusiasm for Hillary among women, Hispanics and African-Americans. And according to another recent Gallup poll, Hillary has a 22 point lead over her closest competitor among those who earn less than $50,000 per year.", "title": "Press Release - Campaign Memo: After Six Months"}
