{"date": "2008-02-07", "text": "Underscores Her Plan to Fight HIV/AIDS Plaguing the African-American Community On the seventh annual observance of National Black HIV/AIDS Awareness Day, Senator Clinton underscored her commitment to fight HIV/AIDS at home and abroad, and to reduce the disproportionate burden of HIV/AIDS in communities of color. HIV/AIDS is a worldwide epidemic and impacts tens of thousands of Americans each year. Although the disease knows no color or ethnicity, it continues to strike African-Americans at alarming rates. While African Americans make up only 13% of the U.S. population, they account nearly half of new HIV and AIDS diagnoses each year. And AIDS is the leading cause of death among African American women age 25-34. Senator Clinton's domestic and global HIV/AIDS plan, announced in November 2007, outlines a comprehensive approach to combating HIV/AIDS through prevention, education, and access to treatment. \"I am committed to making HIV awareness and prevention a priority and to working toward an eventual cure,\" said Senator Clinton. \"We must double research funding, increase treatment and prevention programs, and encourage family and friends to become educated and tested to help stop the spread of HIV and AIDS. I will work tirelessly to combat this deadly disease and to finally get serious about reducing the disproportionate burden HIV/AIDS imposes on the African American community.\" she concluded. Senator Clinton has the most ambitious plan of any candidate running for President to address the disparities in HIV/AIDS incidence in communities of color. She is the only candidate committed to increasing funding for the Minority AIDS Initiative, and for ensuring that every HIV positive person - and every single American - has quality affordable healthcare. She has a plan to partner with stakeholders and community leaders to reverse the upward trend in HIV rates among African Americans and support the prevention and treatment efforts of minority-run community based organizations. HILLARY CLINTON'S PLAN TO FIGHT HIV/AIDS IN THE U.S. With a coordinated and comprehensive effort, Senator Clinton knows we can significantly reduce the number of new HIV infections annually and help provide coordinated care and treatment to Americans currently living with HIV/AIDS. As President, Hillary will combat HIV/AIDS in the U.S. by:  Developing and implementing a Comprehensive National AIDS Strategy;  Guaranteeing health insurance for every single person living with HIV/AIDS as part of a commitment to truly universal healthcare;  Halting and reversing the burden of AIDS among African-Americans by increasing funding for the Minority AIDS Initiative and supporting community-based programs.  Increasing funding for the Ryan White CARE Act;  Doubling the U.S. contribution towards researching a vaccine for HIV/AIDS and increasing commitments to research;  Ensuring access to care for all Americans living with HIV;  Increasing funding for evidence-based HIV/AIDS prevention;  Addressing high risk behaviors that often lead to HIV/AIDS;  Improving opportunities for substance abuse treatment;  Providing housing opportunities and supportive services for people with AIDS;   This plan builds on Hillary's long history of working to address the HIV/AIDS epidemic. As Senator, she has introduced legislation to expand access to treatment for low-income individuals living with HIV; pushed to make scientific, evidence-based prevention programs more available to youth; sought to increase coordination in combating global AIDS; championed legislation to provide universal basic education that would help prevent the spread of AIDS, and consistently supported increased funding for federal efforts against the epidemic both in the U.S. and around the world. For more information about Senator Clinton's Plan to Fight HIV/AIDS at Home and Abroad please [Click here]. For more information about Hillary's American Health Choices Plan please [Click here].", "title": "Press Release - Hillary Clinton Recognizes National Black HIV/AIDS Awareness Day"}
