{"date": "2007-11-19", "text": "Calls For Immediate Action To Reduce Foreclosures, Lower Consumer Energy BillsToday in Knoxville, IA, Hillary Clinton offered a serious assessment of the economic challenges facing our country, outlined her plan to restore the middle class, and called for specific steps to reduce foreclosures and help families manage skyrocketing energy bills this winter. As President, one of Hillary's top priorities will be to responsibly manage our economic challenges in the face of deepening anxiety about our economic outlook. Most importantly, she will be ready to lead on economic issues on day one of her Presidency and will focus on rebuilding America's middle class. \"The next president will be a steward of our economy at a time when the bills from eight years of neglect and mismanagement will be coming due. He – or she – will have to turn our nation and our economy around,\" Clinton said. \"More than ever before, our workers will need good job training for the jobs of this new century. But we can't afford on-the-job training for our next president. That could be the costliest job training in history. Every day spent learning the ropes is another day of rising costs, mounting deficits and growing anxiety for our families. And they cannot afford to keep waiting. \"My plan to turn our economy around has four components: creating the new, good jobs essential to broad-based prosperity; restoring fairness to our economy; renewing the basic bargain that if you work hard, you can get ahead; and putting our fiscal house in order again. I will help create opportunity for those left out during the Bush years while shifting the cost of the changes we need to those special interests that have gotten a free ride.\" Adding to her detailed plans to help rebuild the middle class, Hillary called for immediate action to help families fight foreclosures and pay their skyrocketing energy bills: Double the budget of HUD's Housing Counseling Assistance Program and make an additional $100 million immediately available; Convene a \"crisis conference\" of housing stakeholders to stop the spike in foreclosures; Implement a Crash Home Conservation Initiative for 3 Million Families; Increase emergency energy assistance funding help more than 1 million additional families. ### HILLARY CLINTON'S PLAN TO ADDRESS AMERICA'S ECONOMIC CHALLENGES ECONOMIC CHALLENGES:", "title": "Press Release - Clinton Outlines Plan To Address America's Economic Challenges"}
