{"date": "2007-07-31", "text": "Hillary Clinton To Attend Largest Watch Party in West Hollywood In a first for a presidential campaign, Hillary Clinton for President is utilizing the campaign Web site to ask her LGBT supporters to organize forum watch parties on August 9th. The appeal was made in anticipation of the presidential forum focused on LGBT issues and hosted by the cable channel Logo and the Human Rights Campaign (HRC) in Los Angeles. The largest forum watch party is expected to take place at the Abbey Food & Bar in West Hollywood, which will provide a live telecast of the event. After the forum, Hillary Clinton will make an appearance at the Abbey. \"I look forward to sharing my views on issues important to LGBT Americans at the Logo/HRC presidential forum,\" said Clinton. \"I hope people take this opportunity to gather at forum watch parties and learn how we can work together to move our nation closer to the promise of fairness and equality that all Americans deserve.\" The forum watch party at the Abbey starts at 6:00 p.m. (PDT) and the tickets are $50. They can be purchased at: https://contribute.hillaryclinton.com/events/hollywood0809.html. SBE Restaurant and Nightlife Group's Sam Nazarian, Brent Bolthouse and David Cooley are the co-hosts for the event. To find out more information on how to organize your own forum watch party, [Click here] www.hillaryclinton.com/LGBT. The organization of forum watch parties is part of the campaign's ongoing outreach to the LGBT community. In June, the campaign launched LGBT Americans for Hillary, a national steering committee of over 65 leaders in the lesbian, gay, bisexual, and transgender (LGBT) community. This leadership committee is working with the campaign on several areas including political outreach, communications, policy advice and counsel, and fundraising. In addition, the campaign has posted its position paper on LGBT issues on its Web site. Hillary Clinton has worked to advance the cause of equality for LGBT Americans for many years. As president, Clinton has pledged to end the divisive leadership of the past six years and work with the LGBT community to make sure that all Americans in committed relationships have equal economic benefits and rights. She also will work to end discrimination in adoption laws. As a U.S. Senator, she has worked to expand federal hate crimes legislation and pass the Employment Non-Discrimination Act, and will sign the legislation into law once she is in the White House. She will also put an end to the failed policy of Don't Ask, Don't Tell.", "title": "Press Release - Clinton Campaign To Organize Watch Parties Around Logo/Human Rights Campaign Forum"}
