{"date": "2007-11-27", "text": "\"Senator Clinton's proposed domestic HIV plan is comprehensive and recognizes that collaboration of many sectors and integration of various Federal programs are essential to a successful National AIDS Strategy. There is simply no reason why we cannot significantly reduce the number of new HIV infections in this country and ensure access to care and treatment for all those infected. Senator Clinton has a track record of leading efforts to increase appropriations for HIV services and prevention, and increasing access to medical treatment through Medicaid. With this plan, she demonstrates the political leadership required to make a real difference in stopping this epidemic.\" --Rebecca Haag, Executive Director, AIDS Action \"As the voice for more than one million Americans living with HIV/AIDS, the National Association of People with AIDS (NAPWA) commends presidential candidate Senator Hillary Clinton for her recently announced plan to address the HIV/AIDS health crisis domestically and internationally.\" --NAPWA press release, 11/27/07 \"Hillary Clinton has a strong track record on HIV/AIDS in the U.S. Senate, and her AIDS plan shows she understands the devastating impact of the epidemic and the details of how to fight it effectively – particularly in communities of color. It's important for every candidate in both parties to take AIDS as seriously as Senator Clinton has today. We applaud Senator Clinton for seriously addressing the public health and social justice aspects of this pandemic and we continue to encourage all candidates in both parties to provide comprehensive plans that will end AIDS.\" --Christine Campbell, Director of National Advocacy and Organizing, Housing Works (nation's largest community-based AIDS group and nation's largest minority-controlled AIDS group) \"I applaud Senator Hillary Clinton for introducing this very comprehensive domestic HIV/AIDS platform. This is exactly the kind of aggressive, forward thinking domestic HIV agenda that we need from the nation's next President. We are particularly pleased that the Senator's plan includes eliminating the ban on federal funding for needle exchange, which will save countless lives. I hope that all the candidates for President, regardless of party or philosophy, come out with similar, thoughtful domestic HIV agendas for their Presidency.\" --Matthew Lesieur, Director of Public Policy, New York AIDS Coalition \"I am thrilled to see Senator Clinton's plan of action on HIV/AIDS. Senator Clinton's proposals are the kind that will move us towards real victory against this terrible virus, in Southern Africa and beyond. Her proposal clearly addresses the needs of children, and that certainly makes it stand out among the plans issued so far by the candidates for President. Children have been neglected in the AIDS response, and her plan would remedy this deplorable gap in the global fight against AIDS. In addition, it stands out by explicitly addressing a range of women's health and development issues, including the need to end violence against women, address income insecurity and fund reproductive and sexual health programs. Senator Clinton has seen these related issues up close, in her visits to programs in India, Uganda and other countries, and her proposal demonstrates the kind of leadership the world needs on HIV/AIDS.\" --Dr. Paul Zeitz, Executive Director, Global AIDS Alliance Fund", "title": "Press Release - Leaders In The Fight Against HIV/AIDS Laud Clinton Plan"}
