{"date": "2008-01-25", "text": "Announces Student Borrowers' Bill Of Rights, Will Increase College Access for Low-Income Students, Support for HBCU's and HSI's At a speech at Benedict College in South Carolina today, Hillary Clinton announced a plan to protect students and their families from predatory lending practices that have been increasingly prevalent in the private student loan market. She called for a Student Borrowers' Bill of Rights that would provide students with a right to timely, accurate, and transparent information; a right to affordable loan payments; and a right not to be exploited by loan programs. The announcement comes as the financial burden for student loans is increasingly harder for many families to bear. According to the Project on Student Debt, the average debt for a college graduate has soared 50% after inflation in the past decade. The average undergraduate owes just over $20,000 in student loans, with some students facing thousands more. \"Education loans should open the doors of opportunity, not condemn students to years of unmanageable debt. But today, just the opposite is happening,\" said Clinton. \"I want to put these private loan companies on notice - when I'm President, we're going to hold you accountable. I'll create a Student Borrower's Bill of Rights to clean up the private student loan industry.\" In addition, Hillary will launch a major new initiative to reward colleges and universities that serve large proportions of low-income students and enable these schools to invest more heavily in recruitment and retention efforts for these students. This initiative will provide colleges and universities with an additional $500 for each Pell-eligible student above 25% or 1,000 students. Over Hillary's first term, she will increase funding for the Strengthening Historically Black Colleges and Universities fund by $50 million annually, to $438 million annually - a total investment of $1.4 billion. She will provide the same increase to Hispanic Serving Institutions (HSI), growing their funding to close to $300 million annually by 2012. \"There may be an education gap in this country, but there is not a potential gap. Every single child in America is born with the God-given potential to succeed,\" said Clinton. \"And when we don't give them the chance to fulfill that potential, then we should be ashamed of what that says about America in 2008. And we should change it.\" These new initiatives build on Hillary's comprehensive plan to make college more affordable. She has proposed to more than double the HOPE tax credit, raising the maximum amount of benefits that students and their families can receive from $1,650 to $3,500. This new credit will cover more than 50% of the typical cost of public colleges and universities and more than the full cost of tuition of community colleges. She has also called for a Truth-in-Tuition policy so that schools have to set multi-year tuition rates and an increase to the maximum Pell Grant that students can receive to keep pace with the rising cost of college. Hillary Clinton's full plan on widening the circle of opportunity is below: Widening the Circle of Opportunity", "title": "Press Release - Clinton Pledges To Protect Families From Predatory College Loans"}
