{"date": "2007-10-19", "text": " To: Interested Parties From: Mark Penn Date: October 19, 2007 Re: How Hillary Will Win the West The Western United States. The fastest growing region in the country. The largest number of new immigrants. Home to Las Vegas, Silicon Valley, Napa Valley, Hollywood and our largest national parks, the source of most of America's fruit, beef and wine and much of our oil, land of dot-coms, ranches and retirement communities - rapidly becoming the most diverse part of America. Hillary Country. Hillary has generated excitement in Arizona, Colorado, Nevada, Washington, California and across the West, where she's given thousands of supporters the chance to see her up close. And the endorsements keep rolling in: former Washington Governor Gary Locke, Los Angeles Mayor Antonio Villaraigosa, California Assembly Speaker Fabian NuГѓВ±ez, Colorado House Speaker Andrew Romanoff, California Senator Dianne Feinstein, Oakland Mayor Ron Dellums, former Denver Mayor Wellington Webb, California Controller John Chiang, as well as Arizonan Raul Yzaguirre, former president of the National Council of La Raza, the leading Hispanic advocacy organization in the country. Nowhere is Hillary's Western strength more evident than in Nevada, where a recent poll shows her breaking 50% in the primary and leading by 37 points. And her support among local leaders only continues to grow, including: Clark County Commissioner Rory Reid, former Governor Bob Miller, Senate Minority Leader Dina Titus, former Las Vegas Mayor Jan Jones, State Treasurer Kate Marshall, Assembly Majority Leader John Oceguera, Dr. Robert Fowler, Clark County Commissioner Chris Giunchigliani, former Attorney General Frankie Sue Del Papa, Las Vegas Latin Chamber of Commerce Chairman Robert Gomez and Reno-Sparks Indian Colony Chairman Arlan Menendez.. This summer, Hillary has drawn huge crowds across the Silver State, including 3,500 in Reno, more than 3,000 in Las Vegas and even 2,500 in rural Pahrump—where she's opened a regional field office. The Clinton campaign has brought the Hillary tour to most of the Western states, and has a strong on-the-ground presence with offices, field organizers, and thousands of volunteers spanning the region. And the West is turning out to be a stronger region for Hillary Clinton than anyone anticipated.  1. Hillary Is Winning Democratic Primary  Hillary leads the Democratic primary by more than 20 points in the West, with an overwhelming lead in Arizona, California, Colorado, Nevada, Oregon, and Washington. Recent Democratic Primary Polls", "title": "Press Release - Memo: How Hillary Will Win the West"}
