{"date": "2008-05-20", "text": "Hillary Clinton unveiled her proposal to provide increased opportunity and improve the quality of services for South Dakota's Native American community today. Her plan, grounded in the principle of tribal sovereignty, focuses on job creation, improving the quality of health care and combating crime.\"For seven years, the Bush Administration has failed to live up to its commitment to the Native American community in South Dakota and across the nation,\" Hillary said. \"By making targeted investments to create good-paying jobs and ensuring everyone has access to quality, affordable health care and by continuing to partner with the Native American community within the government to government framework, we can begin to undo some of the damage President Bush's neglect has caused.\" Four of the five counties with the lowest per capita income are in South Dakota's Indian country, reversing a trend of successful economic growth in the 1990's. As President, Hillary will invest in work force development programs to ensure Native Americans are prepared for the high-wage, high-skill jobs of the 21st century. She will also fund research in renewable energies, including wind and solar, which will help lower energy costs and create good jobs in Indian country. \"Native Americans had a productive partnership with the Clinton administration during the 1990's, and Hillary understands the importance of that partnership in improving the quality of life in our community,\" said Lula Red Cloud. \"Native Americans in South Dakota need a President who will provide economic opportunities and curb the health, addiction and crime problems that are sweeping across our communities, and Hillary has the proposals and the experience to do just that.\" Hillary's plan will expand access to affordable health care by increasing funding for the Indian Health Service budget and elevating the director of the Indian Health Service to the Assistant Secretary level. She will declare war on juvenile diabetes to counter the skyrocketing incidence rate of the disease among young Native Americans. The plan also targets increased crime rates, particularly crimes related to the sale and use of crystal meth, by providing additional resources for Indian country law enforcement. Hillary's full Native American Agenda for South Dakota is below. ### Hillary Clinton's Native American Agenda for South Dakota: Provide Vital Services to Strengthen Tribal Economy, Health Care and Education, and to Combat Crime", "title": "Press Release - Hillary Clinton Unveils South Dakota Native American Agenda"}
