{"date": "2007-10-17", "text": "Chaz Proulx Joins Activists Announcing Their Support today MANCHESTER, NH – The New Hampshire for Hillary campaign continues to build strong and diverse support throughout the Granite State and today announced the names of 333 Grassroots Activists for Hillary. The announcement comes on the heels of this week's trip to the Granite State where Senator Clinton announced her plans to create jobs for the 21st Century and make college more affordable for America's middle class families. Chaz Proulx, who grew up in Raymond, is a well-known Democratic activist who worked extensively in grass roots organizing and also works regularly within the New Hampshire Democratic Party structure. \"Hillary's Clinton's policies on all the major issues I care about are intricately thought out and her three decades of public service are unequaled,\" said Proulx, who works part time as a political and issue advocacy consultant. \"She has been a visionary on health care, which tops my personal list of domestic concerns. Iraq, of course, continues to drag our country down in every imaginable way. Hillary Clinton has authored the Iraq Troop Protection and Reduction Act of 2007. We can't solve the Iraq problem alone and we need Hillary Clinton to be President because she can rebuild credibility worldwide.\" A veteran of many political battles, Chaz has worked with everyone from Howard Dean to first time school board candidates. In 2006 he dedicated most of his efforts to Carol Shea Porter's innovative campaign for the U.S. Congress. \"I am honored to have the support of so many dedicated community activists,\" said Senator Clinton. \"I will look to them to share my vision for the country with their friends and neighbors across the Granite State.\" The following is a list of 333 community activists from across the state who today announced their support for Hillary Clinton. CLAREMONT AREA  Kathryn Bowen (Claremont), Claremont activist  Jessica Bugbee (Charlestown), Charlestown activist  Mary Dakin (Claremont), Claremont activist  Laurel Eaton (Claremont), Small Business Owner  Roger Ferland (Lempster), Lempster activist  Carroll \"Dave\" French (Langdon), Langdon Democrats Chair; former State Senate candidate  Joseph Harris (Claremont), former State Representative  Sandra Harris (Claremont), former State Representative  John Luna (Newport), Newport activist  Roy Malool (Newport), Newport activist and Small Business Owner  Thomas Shanklin (Lempster), Lempster activist  Kelly Torrey (Charlestown), Charlestown activist  Celestine Wiggins (Newport), Newport Democrats Chair CONCORD AREA  Gracia Berry (Concord), Peace activist and Director of Women's Education and Resource Center  Lenita Bofinger (Concord), Education activist and retired professor  Paul O. Bofinger (Concord), Concord activist and environmentalist  Bill Boudreau (Pittsfield), Pittsfield activist  Lynn Brofos (Contoocook), Contoocook activist  Lawrence Burgeron (Loudon), Loudon activist  Odie Champagne (Epsom), Epsom activist  Rep. Claire Clarke (Boscawen), State Representative  Gabriel Daneault (Allenstown), Allenstown Democrats Chair and former State Representative  Susan Decato (Canterbury), Canterbury activist  Stephen Enroth (Sutton), Sutton activist  Thomas Fagan (Bow), Bow Selectman  Cindy Fleming-Wood (Pembroke), Pembroke activist  Kathy Fuller (Franklin), Franklin activist and former School Board Member  Mary Lou Heavey (Henniker), Henniker activist  Martin Honigberg (Concord), Concord activist; Concord School Board Member; former legal counsel to Gov. Jeanne Shaheen  Brenda Kern (Concord), Concord activist  David Kinsman (Newbury), Newbury activist and City Councilor  Maryann Lakevicius (Concord), Concord activist  Thelma Lemire (Franklin), Franklin activist  Natale Linton Brown (Concord), Longtime Concord activist  Ernest Mahar (Franklin), Franklin activist  William McGonagle (Concord), Concord activist  Dick Phelps (Chichester), Chichester activist  Bob Quinn (Concord), Longtime Concord activist  Rachel Rowe (Concord), Concord activist  Jean Strollo (Pembroke), Pembroke activist  Tony Strollo (Pembroke), Pembroke activist  Theresa Zinis (Allenstown), Allenstown activist CARROLL COUNTY  Judith Apy (Wolfeboro), Wolfeboro activist  Carol Blotner (Bartlett), Bartlett activist and former Kennett High School Principal  Sylvia Kennedy (Wolfeboro), Wolfeboro activist; physician; former Exeter School Board Chair  Bob Mclean (Tamworth), Tamworth Democrats Chair  Wendy Palm (Wolfeboro), Former Tamworth Democrats Chair DOVER AREA  Elizabeth Anderson (Somersworth), Somersworth activist  Joan Ashwell (Durham), Strafford County Democrats Chair  Dr. Tim Ashwell (Durham), Durham Democrats Chair  Jack Buckley (Dover), former Mayor of Dover  Carmen Buford-Paige (Dover), Dover activist  Bill Caldwell (Dover), Dover activist  Lynn Carey (Dover), Dover activist  Warren Daniel (Durham), Durham activist and Small Business Owner  Jay Dean (Dover), Dover activist  Lois Deyoung (Dover), Dover activist  Sylvia Fosco (Dover), Dover activist  Carol French (Dover), Dover activist  Doris Gibbas (Rollinsford), Rollinsford activist  Betty Hannan (Dover), Dover activist  Verdi Johnson (Dover), Dover activist  William Knowles (Dover), State Representative  Katherine Latchaw (Dover), Dover activist  Yitzhak Margowsky (Somersworth), Somersworth activist  Janet Mason (Dover), Dover activist  Robert McGloan (Dover), Dover activist  Frank Pasternak (Somersworth), Somersworth activist  Gregory Pearlman (Dover), Dover activist  Arthur Pelletier (Dover), former State Representative  Michael Ploski (Newmarket), Newmarket Town Councilor  Pam Raley (Dover), Dover activist  Francine Torge (Durham), Dover activist  Kenneth Ward (Rollinsford), Rollinsford Democrats Vice Chair; firefighter  Diane Webb (Dover), Dover activist  Robert Wunder (Dover), Dover activist CHESHIRE COUNTY", "title": "Press Release - NH for Hillary Campaign Announces 333 Grassroots Activists for Hillary"}
