{"date": "2016-02-16", "text": "\"These are problems of racial inequality—and we have got to say that loudly and clearly.\" Hillary Clinton just delivered an address on tearing down the barriers that hold African Americans back—and building ladders of opportunity in their place. \" The truth is we aren't a single-issue country. We face a complex set of economic, social, and political challenges. They are intersectional, they are reinforcing, and we have got to take them all on.\"Hillary, February 16, 2016 And she laid out a plan to create and connect black communities to good jobs, help African American families pursue homeownership, end the school-to-prison pipeline, and reform our criminal justice system.And the reaction to her speech made it clear this is a conversation America needs to have.?I am so proud of @HillaryClinton for finally calling out Republican obstructionism during the Obama presidency for what it is - RACISM.— Jason Latty (@latty_jason) February 16, 2016Hillary Clinton breaking down environmental racism. This does not happen in elections. https://t.co/wGKZT2yKWq— Tracey Ross (@traceylross) February 16, 2016Real talk from Fmr Sec. @HillaryClinton about voting injustice calling it \"A blast from our Jim Crow past\"— Michael Blake (@MrMikeBlake) February 16, 2016We will invest in black entrepreneurs. Let's ensure equal pay for equal work for women, that would benefit women of color-@HillaryClinton— jamiaw (@jamiaw) February 16, 2016When was the last time a leading candidate for President put the onus on \"race relations\" on white people? Has it ever happened before?— Will Cubbison (@wccubbison) February 16, 2016\"Hillary Clinton Addresses African American Voters in Harlem\" https://t.co/ogw5aQPBra Check out my latest for @BlogHer cc: @hillaryclinton— Beautiful (@FeministaJones) February 17, 2016What did you think of Hillary's remarks? Text NOW to 47246 to share your reaction.", "title": "Press Release - Hillary Clinton Just Delivered a Major Address On Racial Justice—here's What People Are Saying"}
