{"date": "2007-10-12", "text": "Hillary's College Affordability Plan Could Help 36,000 SC H.S. Seniors (ORANGEBURG) – State Senator and Hillary Clinton Campaign South Carolina Co-Chair John Matthews unveiled a report detailing the impact in South Carolina of Hillary's new proposal for college affordability, calling it the best chance to expand opportunity Palmetto State students. Hillary nationally released her plan to make college affordable today. \"South Carolinians recognize the tremendous value of a college education. But it's the means to get there, to get in school and to finish, that is the major obstacle as tuition costs skyrocket and families are left squeezing their budgets to pay for it,\" Matthews, surrounded by students at Claflin University, said. \"Hillary's plan offers financial relief and the opportunity for a higher education, a better paying job and a higher standard of living to tens of thousands of South Carolina families and young people struggling to come up with the money for college.\" Over the course of a 40-year career, college graduates can expect to earn, on average, nearly $1 million more than high school graduates, according to the impact report released today. But the share of family income, even after financial aid, needed to pay for college expenses has increased significantly in South Carolina from 1992 to 2006: 22 percent to 27 percent for community colleges; 28 percent to 36 percent for four-year public institutions, and 48 percent to 60 percent for four-year private institutions. Even at the lowest-priced colleges, the share of income that the poorest families have to pay for tuition in 2006 was 28 percent, up from 15 percent in 1992. For the more than 36,000 South Carolina high school seniors considering going to college, or the more than 200,000 students already attending college, Hillary's plan will offer a new $3,500 tax credit. Hillary is proposing to more than double the HOPE tax credit, raising the maximum amount of benefitsthat students and their families can receive from $1,650 to $3,500. This new credit will also be partially refundable in order to increase its value to low-income individuals. It will phase out at about the same levels as the HOPE credit and will be advanceable to allow families to receive the tax credit when their tuition bills are due instead of 16 months later. According to the state report, graduates from four-year public and private colleges in South Carolina face an average of $19,697 in debt, placing the state at 19th in the country in terms of debt level. Seventy-one percent of all graduates from four-year public and four-year private colleges in South Carolina carried debt after graduation. The average loan amount that a South Carolina student borrowed in 2006 was $4,118. For the more than 80,000 South Carolina students enrolled in two-year programs or thinking of going to a community college, Hillary's plan to strengthen community colleges will offer tremendous benefit. Hillary's plan will provide $500 million in incentive grants for partnerships between community colleges and four-year colleges. In South Carolina, 43 percent of students are enrolled in community colleges. Those who are among the 40 percent of the population with the lowest income must spend half of their income – 43 percent – to go to community college. The full impact report is included below. Expanding Access to the American Dream: Hillary Clinton's Plan to Make College Affordable for South Carolina's Families ", "title": "Press Release - Sen. Matthews Unveils SC Impact for Hillary's Plan to Help Families Afford College at Claflin University"}
