{"date": "2007-10-22", "text": "The Clinton Campaign today announced the endorsement of Democratic leaders from the Central Valley. The men and women supporting Hillary Clinton include assembly members, mayors, mayors pro tempore, councilmembers, school board officials and commissioners as well as several Democratic organizations that believe Hillary Clinton has the strength and experience to bring the change that Californians and Central Valley residents need and want. \"I am grateful to all those who are endorsing the need for change in this country and I am eagerly looking forward to visiting the Central Valley,\" said Clinton who will visit Fresno High School for a rally on Monday morning. \"As the next President of the United States, Hillary will lead this nation in a direction of hope, change and prosperity,\" said Assemblymember Juan Arambula (D-Fresno). \"Senator Clinton is the most qualified candidate in the race having tackled such critical issues as healthcare, education, job creation and a strong defense. Hillary Clinton is a positive change for our country and most especially for the Central Valley. I am proud and honored to offer my strong endorsement for Senator Hillary Clinton. \" \"I believe Senator Hillary Clinton understands the importance of Fresno and the Central Valley as it pertains to the nation as a whole,\" said Cynthia Sterling, Fresno City Councilwoman. \"Our area has the highest concentration of poverty and yet we are the place that feeds the world. Senator Clinton will be a champion for our area in bringing the necessary resources to sustain a healthy agriculture economy. As President, I know that Hillary Clinton will ensure that Fresno and the valley is foremost on her mind when it comes to such tough issues as immigration, high unemployment and affordable housing.\" \"Senator Clinton has a great understanding and insight on critical issues facing our nation as well as the Central Valley. Senator Clinton's efforts on the environment, health care, education, and the economy are important to our quality of life here in the Central Valley and Fresno,\" said Fresno City Councilmember Blong Xiong. ###  Central Valley Leaders who Endorse  Hillary Clinton for President: ", "title": "Press Release - Central Valley Elected Officials and Democratic Leaders Endorse Hillary Clinton"}
