{"date": "2016-05-09", "text": "Monday, Congressman Ted Lieu, a Lieutenant Colonel in the U.S. Air Force Reserves, released the following statement in response to Donald Trump's comments on the Post-9/11 G.I. Bill:\"This morning, Donald Trump was asked point blank if he supported the Post-9/11 G.I. Bill, and he said no. For a candidate who talks a big game about helping veterans, this is a rather astonishing statement. As a veteran myself, I understand just how instrumental this legislation has been in ensuring that the brave men and women who serve our country have every opportunity to succeed when they finish their service. Our vets simply cannot risk a president who doesn't understand their needs.Furthermore, Trump falsely attacked Hillary Clinton's commitment to veterans, baselessly claiming that she thinks the 'vets are getting too much.' That couldn't be further from the truth. As a Senator, Hillary Clinton repeatedly worked across the aisle to successfully expand veterans' benefits. And on this campaign she has laid out a comprehensive plan to enhance support for our veterans, including a commitment to fight any efforts to the weaken the Post-9/11 G.I. Bill. Donald Trump should stop making false attacks, stop offering empty rhetoric to our veterans, and start offering them the respecting and support they deserve.\"Background: Donald Trump on New Day, 5/9/16:CHRIS CUOMO: On the military, you raise an important issue. We tried to get your campaign and the other campaigns to hold forth on whether or not they supported the current G.I. bill. As you know, in the Congress, they did this sneaky vote in the House where there was no roll call, and they were going to cut money from the G.I. bill to allow for other expenditures for vets. The vets were very upset. They said 'no, don't take money from us and reallocate it. Find the savings elsewhere.'Do you support maintaining the G.I. bill the way it is right now and even growing it instead of cutting it?DONALD TRUMP: I don't want to be hurting our vets. Our vets have been hurt enough. We treat illegal immigrants better than we treat our vets. So I'm going to do nothing to hurt our vets. I'm going to only help the vets --CHRIS CUOMO: So is that a yes? --DONALD TRUMP: -- unlike Hillary Clinton, that thinks the vets are getting too much. And they're not getting too much. I've traveled, I've seen so many vets, I know so many vets now, and I have a lot of friends -- I have developed great friendships among the vets. Our vets are being treated so badly --CHRIS CUOMO: So is that a yes, I do support the current G.I. bill?DONALD TRUMP: No. I want to bring jobs back to our country. According to the VA, over 700,000 veterans and their family members have already benefitted from the Post-9/11 G.I Bill, receiving over $20 billion in benefits. Hillary Clinton has been a strong and consistent supporter of the Post-9/11 G.I. Bill. Clinton voted for the bipartisan bill in 2008, which passed the Senate with an overwhelming 92-6 vote, and co-sponsored an earlier version of the bill. Her comprehensive veterans' plan calls for making \"the Post-9/11 GI Bill a lasting part of the nation's social contract with those who serve.\" Moreover, she released a statement earlier this year denouncing Republican efforts to chip away at the bill's benefits, and has called for closing a loophole in the bill that allows for-profit colleges to target veterans. As a Senator, Clinton repeatedly worked across the aisle to expand benefits to veterans. Clinton worked with Sen. Lindsey Graham to expand veterans' access to military health insurance, with Sen. John McCain to fund a new rehabilitation center for Iraq and Afghanistan veterans, introduced legislation with Sen. Kay Bailey Hutchinson to expand benefits afforded to surviving spouses, and joined with Sen. Chuck Hagel to support legislation to increase gratuities paid to family members of fallen veterans. The Hill, 5/8/16: Veterans call on Trump to show respect: \"More than 50 veterans released a statement Sunday calling on presumptive GOP presidential nominee Donald Trump to show respect for the country's veterans and donate the millions of dollars he allegedly raised during a fundraiser several months ago.\"*Rep. Lieu is issuing this statement in his individual capacity; his views do not reflect the views of the U.S. Government, Department of Defense, or any other agency.", "title": "Statement From Rep. Ted Lieu On Trump's Apparent Opposition To The Post-9/11 G.I. Bill"}
